{
    "MJD-AGBUS": {
        "Name": "Agribusiness",
        "Description": "Agribusiness refers to the collective business activities involved in production, financing, processing and marketing of food and fibre to sustain humanity. With the need to feed the growing world population, the agribusiness sector is emerging to be one of the most important and dynamic in terms of production, consumer spending and employment. Undertaking the Agribusiness major will provide students the opportunity to be part of this growing sector. The major prepares students to apply business and economic principles to address the managerial challenges in the food systems and value chains. Students learn about the management of businesses operating from the farm gate to consumer plates.",
        "Outcomes": [
            "Critically review agribusiness markets in australia and globally;",
            "Demonstrate skills and knowledge to assess agricultural value chains and markets using experimental, modelling and statistical methods;",
            "Explain fundamental agricultural policy, economic, and management tools for agribusiness applications;",
            "Demonstrate capacity to solve agribusiness-related problems using data analysis, business strategy and modeling methods;",
            "Integrate agricultural, scientific and market data with farming systems information to guide agribusiness decision making for improved efficiency, profitability and/or environmental outcomes;",
            "Demonstrate networking, communication and leadership skills; and",
            "apply relevant employability skills for agribusiness."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "ACCT1100",
            "AGRI1001",
            "ECON1000",
            "MKTG1203",
            "SCIE1104"
        ],
        "Level2Units": [
            "AGRI2201",
            "ECON2245",
            "SCIE2205"
        ],
        "Level3Units": [
            "AGRI3004",
            "ANIM3306",
            "ECON3300",
            "MKTG3302"
        ],
        "Level4Units": []
    },
    "MJD-AGBDM": {
        "Name": "Agribusiness and Agricultural Science",
        "Description": "The global population is increasing and with it comes the need for a profitable and economically viable agribusiness sector to meet the food and fibre demand of humanity. The agribusiness sector is important and dynamic in producing food and fibre, consumer expenditure and employment creation. The sector also faces many challenges that requires innovative and visionary leadership.  The extended major in Agribusiness and Agricultural Sciences will provide students with unique the opportunity to be part of this growing sector. Students learn both the agricultural science and business and managerial economic knowledge and skills necessary to address the scientific and managerial challenges in food systems and value chains.",
        "Outcomes": [
            "Demonstrate an understanding of agribusiness markets and agricultural science in australia and globally;",
            "Demonstrate skills and knowledge to assess agricultural value chains and markets using experimental, modelling and statistical methods;",
            "Understand fundamental agricultural policy, economic, and management tools for agribusiness applications;",
            "Demonstrate capacity to solve agribusiness-related problems using data analysis, gis, business strategy and modeling methods;",
            "Integrate agricultural, scientific and market data with farming systems information to guide agribusiness decision making for improved efficiency, profitability and/or environmental outcomes;",
            "Demonstrate networking, communication and leadership skills; and",
            "demonstrate competency in laboratory practice, fieldwork study, report writing, oral presentation and team work skills suited to gain employment in Agribusiness and Agricultural Science.."
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "ACCT1100",
            "AGRI1001",
            "BIOL1131",
            "ECON1000",
            "MKTG1203",
            "SCIE1104"
        ],
        "Level2Units": [
            "AGRI2201",
            "ECON2245",
            "GENE2250",
            "GEOG2201",
            "SCIE2205"
        ],
        "Level3Units": [
            "AGRI3004",
            "ANIM3306",
            "ECON3300",
            "GEOG3301",
            "MKTG3302",
            "SCIE3314"
        ],
        "Level4Units": []
    },
    "MJD-AGSCI": {
        "Name": "Agricultural Science",
        "Description": "Australia's agricultural industry is a key part of the world's food supply system. The challenges of a rapidly growing population, climate change, and the limitations of land and freshwater all impact the ability of agriculture to meet the demand for food, fibre and fuel. As part of the Agricultural Science major, students investigate how to address this demand by developing an understanding of the complex factors that shape agricultural systems. Agricultural Science provides the research, technology and information for the sustainable and ethical development of the agricultural industry. Your studies will include soil science, genetics, cropping systems, soil-plant interaction, livestock production, agricultural economics and grain marketing. There will be up to two field trips to farms and research sites.",
        "Outcomes": [
            "Demonstrate knowledge of the biology of key plants, animals and other organisms and the influence of climate, soils and farm management practices on these components;",
            "demonstrate an understanding of  how agricultural systems and are influenced by socioeconomic issues"
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units. Chemistry ATAR or an additional chemistry unit taken in the first year.",
        "Level1Units": [
            "AGRI1001",
            "BIOL1131",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "AGRI2201",
            "ENVT2236",
            "GENE2250",
            "PLNT2201"
        ],
        "Level3Units": [
            "ANIM3306",
            "ECON3300",
            "ENVT3060",
            "SCIE3314"
        ],
        "Level4Units": []
    },
    "MJD-AGTDM": {
        "Name": "Agricultural Science and Technology",
        "Description": "There is a critical need to produce food and fibre more efficiently and sustainably. There are now rapid changes in the agricultural sector, largely due to developments in agricultural technology. This extended major provides knowledge in both the traditional agricultural science areas as well as the emerging agricultural technologies, which are data intensive. The combination of Agricultural Science with Agricultural Technology will give students the ability to integrate new technologies into agricultural systems for improved decision making and farming efficiency/profitability. In this extended major you will develop skills in agricultural economics, soils, crops and livestock as well as remote sensing and data management and analysis, within an agricultural context.",
        "Outcomes": [
            "Evaluate the effect of soils, plants, animals and the environment on production in mixed farming systems in western australia;",
            "Demonstrate knowledge about agricultural trade and commodity marketing;",
            "Demonstrate skills and knowledge to assess agricultural systems using experimental, modelling and statistical methods;",
            "Demonstrate understanding of fundamental spatial data techniques and digital systems and sensors for agricultural applications;",
            "Demonstrate capacity to solve farming problems using programming and data science methods.;",
            "Integrate agricultural data analysis with farming systems information to guide decision making for improved efficiency and profitability;",
            "Demonstrate effective networking and communication skills; and",
            "demonstrate competency in laboratory practice, report writing, oral presentation and team work skills suited to gain employment in the disciplines of Agricultural Science and Technology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units. ",
        "Level1Units": [
            "AGRI1001",
            "BIOL1131",
            "CITS2401",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "AGRI2201",
            "ENVT2236",
            "GENE2250",
            "GEOG2201",
            "PLNT2201",
            "SCIE2205"
        ],
        "Level3Units": [
            "AGRI3003",
            "ANIM3306",
            "ECON3300",
            "ENVT3060",
            "GEOG3301",
            "SCIE3314"
        ],
        "Level4Units": []
    },
    "MJD-AGTEC": {
        "Name": "Agricultural Technology",
        "Description": "There is a critical need to produce food and fibre more efficiently and sustainably. There are now rapid changes in the agricultural sector, largely due to developments in agricultural technology. This data-intensive technology has the potential to significantly increase production efficiency and reduce the environmental impact from agriculture; however, the key is making sense of the data and developing profitable and sustainable farming strategies. The Agricultural Technology major provides a broad agricultural background along with the necessary skills in data management and analysis, geographic information systems (GIS) and remote sensing. In this major, you will develop skills to integrate data analysis and knowledge of complex agricultural systems to make decisions for improved efficiency and profitability.",
        "Outcomes": [
            "Critically assess mixed farming systems in western australia;",
            "Demonstrate skills and knowledge to assess agricultural systems using experimental, modelling and statistical methods;",
            "Explain fundamental spatial data techniques and digital systems and sensors for agricultural applications;",
            "Demonstrate capacity to solve farming-related problems using programming and data science methods;",
            "Integrate agricultural data with farming systems information to guide decision making for improved efficiency, profitability and/or environmental outcomes;",
            "Demonstrate effective networking and communication skills; and",
            "demonstrate competency in laboratory practice, report writing, oral presentation and team work skills suited to gain employment in the discipline of Agricultural Tecnology.."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "AGRI1001",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "AGRI2201",
            "CITS2401",
            "GEOG2201",
            "SCIE2205"
        ],
        "Level3Units": [
            "AGRI3003",
            "ECON3300",
            "GEOG3301",
            "SCIE3314"
        ],
        "Level4Units": []
    },
    "MJD-ENGEO": {
        "Name": "Environmental Geography and Planning",
        "Description": "This major provides foundational knowledge and skills in environmental geography and planning.  It provides students with an understanding of how environmental processes intersect with planning practice in a range of geographical contexts and at different spatial scales.  ",
        "Outcomes": [
            "Critically evaluate key concepts, theories and practices in environmental geography and planning;",
            "Explain the role of strategic and statutory policy frameworks in guiding environmental planning;",
            "Demonstrate an understanding of appropriate strategic and technical responses to environmental planning issues.;",
            "Discuss the interdisciplinary and professional context within which environmental planning and design is situated; and",
            "5.\tCommunicate environmental planning perspectives and knowledge effectively to specialist and non-specialist audiences using appropriately selected written, oral and visual means."
        ],
        "Prerequisites": "Enrolment in the Bachelor of Environmental Design or Bachelor of Philosophy",
        "Level1Units": [
            "GEOG1103",
            "URBD1000"
        ],
        "Level2Units": [
            "GEOG2202",
            "LACH2000"
        ],
        "Level3Units": [
            "GEOG3303",
            "GEOG3305",
            "GEOG3310"
        ],
        "Level4Units": []
    },
    "MJD-ENVMT": {
        "Name": "Environmental Management",
        "Description": "Growing populations in less developed countries and rising incomes in developed countries are placing increasing demands on the Earth's environment and natural resources. As an Environmental Management student, you will learn how to apply scientific, economic, policy and social analysis to help society make better decisions to protect the environment. If you have a strong interest in science, a commitment to the environment, and want to play a role in the future of our environment, you will be well-suited to study this major.",
        "Outcomes": [
            "Apply economic principles to evaluate  environmental policy decisions;",
            "Critically review policy instruments for managing the environment across local, regional, and global scales;",
            "Integrate models for environmental management using social science and environmental science principles.;",
            "Characterise the  main drivers of environmental change from a scientific, social, cultural, and economic perspective.; and",
            "demonstrate analytical, critical and innovative thinking and communication skills suited to gaining employment in environmental management.."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "ECON1120",
            "ENVT1104",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ECON2224",
            "ENVT2221",
            "GEOG2201",
            "SCIE2267"
        ],
        "Level3Units": [
            "ECON3323",
            "ENVT3362",
            "GEOG3301",
            "GEOG3303"
        ],
        "Level4Units": []
    },
    "MJD-ENVSC": {
        "Name": "Environmental Science",
        "Description": "Environmental Science assesses the impact of human activity on the global environment and develops scientific, risk-based solutions to help secure a sustainable future. This major encompasses both the biological and the earth sciences. Environmental issues are many and varied so the use of an interdisciplinary approach to problem solving is essential. Students develop techniques in scientific modelling to achieve practical solutions to these problems. Environmental scientists deal with issues such as climate change, carbon trading, greenhouse gas emissions, water resource management, salinity, land degradation and rehabilitation, flora and fauna, habitat destruction, deforestation, energy and mineral depletion, air and water pollution, soil erosion, and groundwater contamination. It is envisaged there will be up to three overnight field trips (there will be a cost of up to \\$500 per student to cover the cost of food and accommodation for around 10 nights).",
        "Outcomes": [
            "Demonstrate the skills and knowledge to assess environmental systems, using field, laboratory, modelling and statistical methodologies;",
            "Integrate ecological, physical and chemical processes to guide decision making with respect to human intervention in the environment;",
            "Demonstrate the knowledge to manage and rehabilitate disturbed systems such as natural and agricultural catchments, post mining landscapes, contaminated sites, urban environments, etc; and",
            "demonstrate competency in laboratory practice, fieldwork study, report writing, oral presentation and team work skills suited to gain employment in the disciplines of Environmental Science."
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1131",
            "ENVT1104",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ENVT2220",
            "ENVT2236",
            "ENVT2251",
            "GEOG2201"
        ],
        "Level3Units": [
            "ENVT3338",
            "ENVT3339",
            "ENVT3361",
            "ENVT3362"
        ],
        "Level4Units": []
    },
    "MJD-ENVEM": {
        "Name": "Environmental Science and Ecology",
        "Description": "Environmental Science assesses the impact of human activity on the global environment and develops scientific, risk-based solutions to help secure a sustainable future. Environmental scientists deal with issues such as climate change, rehabilitation and renaturation, habitat destruction or environmental impact assessment.",
        "Outcomes": [
            "Demonstrate broad and coherent theoretical knowledge  and applied technical skills in the disciplines of environmental science and ecology;",
            "Apply scientific principles as well as creative and communication skills in diverse contexts relevant for environmental science and ecology;",
            "Critically review, statistically analyse, and synthesise knowledge around ecological, physical and chemical processes in the environment following scientific principles in natural sciences;",
            "Exercise critical thinking and judgement in identifying and solving problems around climate change impacts, environmental assessments as well as ecological and environmental rehabilitation with intellectual independence; and",
            "demonstrate competency in laboratory practice, fieldwork study, report writing, oral presentation and team work skills suited to gain employment in the  disciplines of Environmental Science and Ecology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "BIOL1131",
            "ENVT1104",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ANIM2220",
            "ENVT2220",
            "ENVT2236",
            "ENVT2250",
            "ENVT2251",
            "GEOG2201",
            "PLNT2201",
            "PLNT2204"
        ],
        "Level3Units": [
            "ENVT3338",
            "ENVT3339",
            "ENVT3361",
            "ENVT3362",
            "ENVT3363",
            "PLNT3306"
        ],
        "Level4Units": []
    },
    "MJD-ENVDM": {
        "Name": "Environmental Science and Management",
        "Description": "Environmental Science assesses the impact of human activity on the global environment and develops scientific, risk-based solutions to help secure a sustainable future. Environmental scientists deal with issues such as climate change, carbon trading, greenhouse gas emissions, water resource management, salinity, land degradation and rehabilitation, flora and fauna, habitat destruction, deforestation, energy and mineral depletion, air and water pollution, soil erosion, and groundwater contamination.",
        "Outcomes": [
            "apply economic principles to evaluate environmental policy decisions"
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1131",
            "ECON1120",
            "ENVT1104",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ECON2224",
            "ENVT2220",
            "ENVT2236",
            "ENVT2251",
            "GEOG2201",
            "SCIE2267"
        ],
        "Level3Units": [
            "ECON3323",
            "ENVT3338",
            "ENVT3339",
            "ENVT3361",
            "ENVT3362",
            "GEOG3301",
            "GEOG3303"
        ],
        "Level4Units": []
    },
    "MJD-GSSCI": {
        "Name": "Geographical and Spatial Science",
        "Description": "Geographical Science is focused on understanding environmental processes and the interaction with people and economies, to address the big questions like climate change, sustainability, land degradation, population growth. A core focus is on using spatial data and techniques such as Geographic Information Systems (GIS) and remote sensing, and also process studies with a focus on fieldwork and the use of modelling. Geographers and spatial analysts are under high demand across the environmental regulation and consulting, mining, government and private sectors as they can provide solutions using complex spatial data.",
        "Outcomes": [
            "apply geographical concepts as in understanding change in human and physical environments"
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "GEOG1104",
            "GEOG1106",
            "GEOG1107",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ENVT2220",
            "ENVT2251",
            "GEOG2201",
            "GEOG2202",
            "GEOG2203",
            "GEOG2206"
        ],
        "Level3Units": [
            "ENVT3306",
            "ENVT3362",
            "GEOG3300",
            "GEOG3301",
            "GEOG3303",
            "GEOG3308",
            "GEOG3311"
        ],
        "Level4Units": []
    },
    "MJD-ARCTA": {
        "Name": "Architecture A",
        "Description": "Architecture provides a rich experience in creative thinking across a broad set of studies bridging the humanities and the sciences. In this major, students engage with the ideas and processes involved in making interventions within built and natural environments. Practical application is supported by consideration of relevant theoretical and ethical aspects of architecture. Units in technology, science, history, theory and communication provide core knowledge of the architecture discipline. In these, students learn how to think and communicate through analytical, critical and representational modes. Running in parallel are the design studio units which offer an immersive and integrative experience. In these units, project-based learning develops students' propositional capacities in relation to a range of contextual concerns: theoretical, environmental, technical, material and spatial. Students learn how to conceptualise and design single buildings, urban configurations and landscapes in response to existing and emerging economic and social needs and desires. Manual and digital technologies and production methods are used to generate drawings, models and prototypes. ",
        "Outcomes": [
            "Demonstrate capacity for analytical, critical and propositional modes of thought;",
            "Respond creatively to local, regional and international contexts, issues and practices;",
            "Engage critically with the history and theory of architecture and allied disciplines;",
            "Integrate technical knowledge and skill in resolving design proposals ranging from simple to moderate complexity;",
            "Demonstrate advanced understanding of the implications for architecture of sustainability;",
            "Work productively in collaborative and transdisciplinary situations; and",
            "communicate at a sophisticated level through a range of manual and digital media."
        ],
        "Level1Units": [
            "ARCT1001",
            "ARCT1010",
            "ARCT1011",
            "ARLA1040"
        ],
        "Level2Units": [
            "ARCT2000",
            "ARCT2010",
            "ARCT2050"
        ],
        "Level3Units": [
            "ARCT3001",
            "ARCT3010"
        ],
        "Level4Units": []
    },
    "MJS-ARCTB": {
        "Name": "Architecture B",
        "Description": "Studying Architecture provides you with a rich combination of experiences in imaginative creativity, the humanities and the sciences. Students learn about the conceptualisation and design of individual buildings, urban configurations and landscapes in response to existing and emerging economic, technical and social needs and desires. The major introduces students to a range of different technologies and production methods, both manual and digitally based, to create drawings, models and prototypes. Your practical studies are supported by investigating design communication, sustainable design and considerations of relevant historical, theoretical and ethical aspects of architecture. You emerge with a knowledge of how to use creative and rational inquiry to analyse and provide solutions to design problems, integrating emerging aesthetic, technical, social and ethical concerns. Students who wish to progress to the Master of Architecture must successfully complete the co-requisite Architecture majors : Architecture A and Architecture B",
        "Outcomes": [
            "Demonstrate skills in conceptualising, developing technical solutions and actualising design propositions of a range of complexities from small and simple to propositions of medium complexity;",
            "Present design propositions through a range of media, both digital and hand-drawn, and digital and physical models; and",
            "demonstrate knowledge of the history and theory of the profession, and be capable of undertaking the professional architectural degree."
        ],
        "Level1Units": [],
        "Level2Units": [],
        "Level3Units": [],
        "Level4Units": []
    },
    "MJD-LDARC": {
        "Name": "Landscape Architecture",
        "Description": "Landscape architecture is primarily concerned with the quality of the environment. It focuses on all aspects of landscape and land use planning, design and management; the restoration and rehabilitation of disturbed environments; and the design and management of outdoor spaces to create exciting, functional and attractive environments that will contribute to the life of the community. The Landscape Architecture major shares a number of units with the Architecture major. As such, cross-disciplinary content, collaboration and learning are key features of these majors. Other points of distinction include an emphasis on discovery through drawing; grounding in cultural landscapes and integration of culturally diverse content; engagement with contexts that are local, regional and international; and an embedding across learning areas of a deep appreciation for sustainability. By studying this major you will develop essential skills in critical thinking, providing you with a strong understanding in the practical, as well as the theoretical, art of landscape design. It will provide you with the foundation to pursue a professional postgraduate qualification in Landscape Architecture. Landscape architects work on a variety of scales, ranging from major regional projects to smaller urban developments which include industrial, commercial, institutional, recreational and residential environments.",
        "Outcomes": [
            "Design projects which take a philosophical and ethical position in regard to the sociopolitical, ecological and aesthetic roles of landscape architecture;",
            "Apply historical, theoretical and technical knowledge to design;",
            "Produce designs which illustrate a basic working knowledge of plants, materials and construction techniques;",
            "Negotiate and resolve complex site planning issues and developmental programs;",
            "Display an active engagement  with experimental design processes and self-directed research;",
            "Work productively in collaborative and trans-disciplinary situations; and",
            "communicate at a sophisticated level in verbal, visual and written modes."
        ],
        "Level1Units": [
            "ARLA1030",
            "ARLA1040",
            "LACH1000",
            "LACH1010"
        ],
        "Level2Units": [
            "LACH2000",
            "LACH2001",
            "LACH2050"
        ],
        "Level3Units": [
            "LACH3000",
            "LACH3001",
            "LACH3003"
        ],
        "Level4Units": []
    },
    "MJD-CMMST": {
        "Name": "Communication and Media Studies",
        "Description": "Communication and Media Studies is one of the most exciting and rapidly evolving areas of study. What we know about the world, and how we act in it, is critically related to the use of communication technologies, from language to screen, and from text to image. This major provides students with essential knowledge about a range of media processes, including journalism, film making, game design and strategic communication, as well as practical communication and digital skills relevant to media, communication and other key professional areas. Communication and Media Studies provides students with the skills to succeed in a rapidly changing international media and communications environment.",
        "Outcomes": [
            "Analyse the history, context and practices of media and communication;",
            "Apply creative, critical and reflective thinking;",
            "Effectively read, speak and write about complex ideas;",
            "Create a variety of media content;",
            "Work with others, organise complex tasks and manage workloads;",
            "Evaluate the social, cultural and legal implications of their actions; and",
            "apply reflective practice and engage in continuous learning."
        ],
        "Level1Units": [
            "COMM1001",
            "COMM1002"
        ],
        "Level2Units": [
            "COMM2001",
            "COMM2002"
        ],
        "Level3Units": [
            "COMM3001"
        ],
        "Level4Units": []
    },
    "MJD-FNART": {
        "Name": "Fine Arts",
        "Description": "The Bachelor of Arts (Fine Arts major) is an intensive studio-based course of study that prepares you for a successful career as a contemporary artist. By working closely with our staff of nationally and internationally recognised practising artists and with experts from related creative arenas such as curatorial practice, art theory and the history of art, you will explore a range of artistic processes, techniques and technologies that will help you to establish your career in the field of contemporary art and culture. ",
        "Outcomes": [
            "Demonstrate a comprehensive knowledge of creative art, the history of its major mannerisms, artists, theorists and formations of thought, to understand its social relevance and responsibilities, and the processes used in its formation;",
            "Articulate the complexities of art as a socially constructed practice that is situated in time and place, and mediated by perspectives shaped by relations to ideology, politics and social intersubjectivity;",
            "Contextualise the practice of creative forms of fine art with other forms of intellectual inquiry and appreciate the relevance of linking theory to practice in the formation of concepts, the discussion of principles and the perspectives of reception;",
            "Use a discursive vocabulary that enables complex arguments to be clearly articulated within artworks and the evolving field of research that surrounds artistic practice and the discourse of design; and",
            "demonstrate a high level of working skills with fine arts media and an understanding of practical methods and presentational protocols used by art to objectify ideas and concepts."
        ],
        "Level1Units": [
            "ARTF1052",
            "ARTF1053",
            "ARTF1054",
            "HART1003"
        ],
        "Level2Units": [
            "ARTF2000"
        ],
        "Level3Units": [
            "ARTF3050"
        ],
        "Level4Units": []
    },
    "MJD-MUSDM": {
        "Name": "Music",
        "Description": "The Bachelor of Music is an advanced, practical degree offering specialisations for composers, electronic musicians, musicologists, and performers.  ",
        "Outcomes": [
            "Integrate transferable skills in critical thinking and communication suitable for professional and academic contexts at a national and international level;",
            "Demonstrate an experimental and creative orientation in the production and presentation of music and sound artworks;",
            "Produce work/s that incorporate specialised knowledge within a stream of composition, music technology, musicology, performance, or music education;",
            "Integrate a command of technique within either composition, musicological research, music technology, or instrumental/vocal performance;",
            "Apply a high level of musicianship and expression within solo, small ensemble, large ensemble, and project settings;",
            "Develop advanced concepts and devices in music language (harmony, rhythm, melody, timbre, texture, dynamic) in aural and written analysis or in relation to physical properties of sound;",
            "Evaluate in-depth concepts of music, taking into account historical, cultural and aesthetic aspects, across a range of genres and time periods, and a global perspective; and",
            "interpret key texts from, a range of music sub-disciplines (e.g. historical musicology, ethnomusicology, psychology of music, music sociology, key musical works from various genres and time periods)."
        ],
        "Prerequisites": "Successful audition with the Conservatorium of Music",
        "Level1Units": [
            "MUSC1055",
            "MUSC1321",
            "MUSC1322",
            "MUSC1340",
            "MUSC1345",
            "MUSC1350",
            "MUSC1591"
        ],
        "Level2Units": [
            "MUSC1592",
            "MUSC2273",
            "MUSC2274",
            "MUSC2276",
            "MUSC2277",
            "MUSC2455",
            "MUSC2520"
        ],
        "Level3Units": [
            "MUSC3336",
            "MUSC3571",
            "MUSC3572"
        ],
        "Level4Units": []
    },
    "MJD-MSTGM": {
        "Name": "Music General Studies",
        "Description": "Music General Studies is a stepping stone to a variety of careers within and beyond the music profession. This major provides you with a rigorous, high-quality tertiary music education with an intermediate specialisation in performance or composition. These studies enable you, as an emerging musician, to transfer to Specialist Music Studies at national and international centres of music excellence, and to postgraduate study to become an accredited music teacher.",
        "Outcomes": [
            "Demonstrate a developing instrumental, vocal or composition technique;",
            "Demonstrate foundational knowledge of key issues relating to music that include music psychology, musical memory,  practice strategies, composition techniques;",
            "Demonstrate an intermediate level of musicianship in  presentation of works within solo, small and/or large ensemble settings;",
            "Demonstrate an awareness of relevant historical and stylistic conventions; and",
            "demonstrate an experimental and creative orientation."
        ],
        "Prerequisites": "Successful audition.",
        "Level1Units": [
            "MUSC1591",
            "MUSC1592",
            "MUSC1741",
            "MUSC1742"
        ],
        "Level2Units": [
            "MUSC2341",
            "MUSC2342",
            "MUSC2591",
            "MUSC2741"
        ],
        "Level3Units": [
            "MUSC2592",
            "MUSC3741"
        ],
        "Level4Units": []
    },
    "MJD-MUSST": {
        "Name": "Music Studies",
        "Description": "Music Studies provides you with a broad grounding in music and allows you to focus on a chosen area of music study through option units, in addition to studying a range of core units. This major ensures you develop expertise and skills in the areas of performance and composition, harmony and aural, Western art music history and popular world music. The Music Studies major attracts students from across the University, at all levels, who are keen to develop their passion and skills in music. As a result you will have the experience of studying alongside students from diverse backgrounds, creating a dynamic and engaging learning environment. Students wishing to specialise in performance, composition or musicology should consider taking the Music Studies major concurrently with the Specialist Music Studies major.",
        "Outcomes": [
            "Demonstrate an established instrumental or vocal technique, an awareness of relevant historical and stylistic conventions, an experimental and creative orientation, and a high level of musicianship and presentation in solo, small and/or large ensemble settings, and/or demonstrate an established compositional technique, an awareness of relevant historical and stylistic conventions, an experimental and creative orientation, and a high level of presentation and attention to detail that enables effective musical realisation;",
            "Identify, describe and apply basic concepts and devices in music language (harmony, rhythm, melody, timbre, texture, dynamic) in aural and written analysis, and in compositional exercises;",
            "Critically engage with, and interpret key texts from, a range of music sub-disciplines (e.g. historical musicology, ethnomusicology, psychology of music, music sociology);",
            "Articulate broad historical perspectives on the nature and contexts of art music in western culture from the renaissance to the present day;",
            "Understand basic performance skills in one non-western musical tradition;",
            "Demonstrate a sociocultural and musical understanding of various forms of world and popular musics from a global perspective;",
            "Demonstrate foundational knowledge of key music education issues, philosophies and practices;",
            "Develop transferable skills in research, critical thinking and communication which enable successful tertiary study, and facilitate postgraduate studies and patterns of lifelong learning; and",
            "develop some specialised knowledge in particular areas through elective studies in music."
        ],
        "Prerequisites": "Passed Conservatorium of Music audition/composition portfolio.",
        "Level1Units": [
            "MUSC1321",
            "MUSC1322",
            "MUSC1340",
            "MUSC1341",
            "MUSC1342",
            "MUSC1350",
            "MUSC1591",
            "MUSC1592"
        ],
        "Level2Units": [
            "MUSC2341",
            "MUSC2342"
        ],
        "Level3Units": [
            "MUSC3341"
        ],
        "Level4Units": []
    },
    "MJD-MEMSD": {
        "Name": "Music: Electronic Music and Sound Design",
        "Description": "Electronic Music and Sound Design is a creative-focused major. Students develop expertise in electronic music composition, sound design and production, programming, and software/hardware instrument design—skills applicable to a range of creative and technical professions. Studio and lab-based units permit students to think creatively, to invent and to innovate, exploring and developing ideas toward the formation of new electronic music and sound art works. The Electronic Music and Sound Design major culminates in a major project of the student's choosing, such as an album of electronic works, a sound installation, a film score, or live performance.",
        "Outcomes": [
            "Demonstrate an established compositional technique with respect to rhythm, harmony and form, identify relevant historical and stylistic conventions;",
            "Articulate broad historical perspectives on the nature and contexts of electronic music and sound art,;",
            "critically engage with key works from the early twentieth century to the present day"
        ],
        "Level1Units": [
            "MUSC1054",
            "MUSC1055",
            "MUSC1350"
        ],
        "Level2Units": [
            "MUSC2273",
            "MUSC2274",
            "MUSC2276",
            "MUSC2277"
        ],
        "Level3Units": [
            "MUSC3571",
            "MUSC3572"
        ],
        "Level4Units": []
    },
    "MJD-EAUTO": {
        "Name": "Automation and Robotics Engineering",
        "Description": "Robotics, automation and Industry 4.0 will provide some of the most exciting opportunities and biggest challenges of our times. Automation and Robotics Engineering at UWA is designed for those interested in contributing to developments in these fields and will provide you with the broad interdisciplinary knowledge and skills that industry is looking for. ",
        "Outcomes": [
            "Apply a range of engineering techniques relevant to the fields of automation, robotics and mechatronics;",
            "Implement design and programming methods for automation and robotics applications;",
            "Integrate software, electronic, and mechanical systems to satisfy a set of operating requirements;",
            "Assess risk, reliability and safety of automation and robotics installations as well as their ethical implications; and",
            "extend personal and collective knowledge in automation and robotics engineering through"
        ],
        "Level1Units": [
            "CITS1401",
            "ELEC1303",
            "ENSC1004",
            "GENG1000",
            "GENG1010",
            "MATH1011",
            "MATH1012"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2200",
            "ELEC2311",
            "ENSC2003",
            "ENSC2004",
            "GENG2000",
            "GENG2004",
            "MECH2004"
        ],
        "Level3Units": [
            "AUTO3002",
            "CITS3001",
            "ELEC3016",
            "ELEC3020",
            "GENG3000",
            "GENG3402",
            "MECH3001",
            "MECH3424"
        ],
        "Level4Units": [
            "AUTO4507",
            "AUTO4508",
            "CITS4402",
            "ELEC5506",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505",
            "GENG5507"
        ]
    },
    "MJD-EBMEG": {
        "Name": "Biomedical Engineering",
        "Description": "Biomedical Engineering is the broad application of engineering principles and design concepts to medicine and the life sciences. It involves combining relevant foundation knowledge from traditional disciplines such as mechanical, electrical, chemical and materials engineering, for the design of biomedical devices and systems; typically towards improving health outcomes. Biomedical Engineering is one of the fastest growing disciplines in engineering and this is anticipated to continue. Biomedical Engineering at UWA prepares you to work in a diverse range of careers, including as a clinical or rehabilitation engineer in a hospital, as a product or design engineer in both established and emerging MedTech companies and/or as a researcher working on cutting-edge technologies. In addition, you will develop the relevant skills to work in health technology roles in a range of areas, including in regulatory agencies, patent attorneys and product development companies. ",
        "Outcomes": [
            "Demonstrate a strong foundation in biomedical engineering;",
            "Solve technical problems relevant to the broad field of biomedical engineering;",
            "Design medical devices that are safe to operate and comply with the regulatory framework in which biomedical engineering is practised;",
            "Demonstrate ethical and professional conduct and high level communication skills in their work and when dealing with others; and",
            "extend personal and collective knowledge in biomedical engineering through research and innovation."
        ],
        "Level1Units": [
            "CITS1401",
            "ENSC1004",
            "GENG1000",
            "GENG1010",
            "GENG1101",
            "IMED1001",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2200",
            "ENSC2003",
            "ENSC2004",
            "GENG2000",
            "GENG2003",
            "GENG2004",
            "MECH2002",
            "PHYL2002"
        ],
        "Level3Units": [
            "BMEG3001",
            "BMEG3002",
            "ELEC3020",
            "ELEC3021",
            "GENG3000",
            "MECH3424"
        ],
        "Level4Units": [
            "BMEG4001",
            "BMEG4003",
            "BMEG5001",
            "BMEG5551",
            "BMEG5552",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505"
        ]
    },
    "MJD-ECHEM": {
        "Name": "Chemical Engineering",
        "Description": "Chemical engineering is an exciting and dynamic field and an ever-changing discipline due to evolutionary and revolutionary changes in technology and society. Chemical Engineering at UWA is designed to produce graduates who are not only capable of finding successful and rewarding lifelong careers as chemical engineers in existing industries, but who can also apply their skills and knowledge to new and emerging technologies in areas such as renewable and alternative energies and energy storage; process intensification and zero emissions technologies; and water reuse, recycling, purification and desalination.",
        "Outcomes": [
            "demonstrate a strong foundation in both underpinning engineering science and core chemical"
        ],
        "Level1Units": [
            "CHEM1001",
            "CHEM1002",
            "CHPR1005",
            "ENSC1004",
            "GENG1000",
            "GENG1010",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CHPR2006",
            "CHPR2007",
            "CHPR2018",
            "CITS2401",
            "GENG2000",
            "GENG2003"
        ],
        "Level3Units": [
            "CHPR3018",
            "CHPR3019",
            "CHPR3404",
            "CHPR3405",
            "CHPR3406",
            "CHPR3407",
            "GENG3000",
            "GENG3402",
            "GENG5010"
        ],
        "Level4Units": [
            "CHPR4501",
            "CHPR5550",
            "GENG4411",
            "GENG4412",
            "GENG5507"
        ]
    },
    "MJD-ECIVL": {
        "Name": "Civil Engineering",
        "Description": "Civil engineering deals with the planning, design, construction and maintenance of the physical and naturally built environment, including roads, bridges, buildings, coastal and offshore structures, drainage and flood mitigation systems, canals and dams. Sub-disciplines include geotechnical engineering, earthquake engineering, structural engineering, surveying, construction engineering and transportation engineering. ",
        "Outcomes": [
            "Apply knowledge and skills in engineering, science, and mathematics to identify, formulate, and solve complex civil engineering problems;",
            "Produce civil engineering solutions that meet specified needs with consideration of ethical and professional responsibilities, safety, cultural, social, environmental, sustainability and economic factors;",
            "Exercise high level communication, collaboration, and project management skills in both individual and team work; and",
            "demonstrate sufficient depth and breadth in civil engineering fundamentals to engage in life-long learning in engineering or other professional fields."
        ],
        "Level1Units": [
            "GENG1000",
            "GENG1010",
            "GENG1014",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2401",
            "CIVL2008",
            "CIVL2551",
            "ENSC2004",
            "GENG2000",
            "GENG2004",
            "GENG2009",
            "GENG2010",
            "GENG2012"
        ],
        "Level3Units": [
            "CIVL3401",
            "CIVL3402",
            "CIVL3403",
            "CIVL3404",
            "GENG3000",
            "GENG3405"
        ],
        "Level4Units": [
            "CIVL4430",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505",
            "GENG5507"
        ]
    },
    "MJD-EELEC": {
        "Name": "Electrical and Electronic Engineering",
        "Description": "Electrical and electronic engineering spans from the nanometres-thick scale of advanced electronic devices to the kilometres-long scale of power transmission, and everything in between. Electrical and Electronic Engineering at UWA is designed to produce graduates who are not only capable of finding successful and rewarding lifelong careers as electrical and electronic engineering in existing industries, but who can also apply their skills and knowledge to new and emerging fields such as sustainable energy solutions, technologies to improve individual and community health, innovations in communications and sensor systems, and the design of electronics that transform lives.",
        "Outcomes": [
            "Demonstrate the fundamental principles of electrical and electronic engineering to enter industry with the critical-thinking skills required to solve real-world problems;",
            "Apply technical, numerical and computing knowledge and tools to the analysis, design, construction, and operation of electrical and electronic components, circuits, and systems;",
            "Adapt new and existing knowledge and practice to current and emerging areas of electrical and electronic engineering;",
            "communicate competently and effectively at a high level through written, oral and visual means"
        ],
        "Level1Units": [
            "ELEC1303",
            "GENG1000",
            "GENG1010",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2401",
            "ELEC2311",
            "ENSC2003",
            "ENSC2004",
            "GENG2000",
            "PHYS2003",
            "STAT2063"
        ],
        "Level3Units": [
            "ELEC3014",
            "ELEC3015",
            "ELEC3016",
            "ELEC3020",
            "ELEC3021",
            "GENG3000",
            "GENG3402",
            "MATH3023"
        ],
        "Level4Units": [
            "ELEC4401",
            "ELEC4402",
            "ELEC4404",
            "ELEC4407",
            "ELEC4505",
            "ELEC5506",
            "ELEC5552",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505"
        ]
    },
    "MJD-EENVE": {
        "Name": "Environmental Engineering",
        "Description": "Environmental engineers apply engineering and scientific principles, including the systems approach, to design solutions in areas such as water resources and wastewater treatment, surface and groundwater systems, and oceans and coastal environments. This may include, but is not limited to, understanding of fundamental environmental processes, environmental risk assessment and management, contaminated site management, environmental regulation, ecological engineering, the impact of climate change on coastal areas such as sea-level rise and beach erosion, oceanography, and environmental modelling. ",
        "Outcomes": [
            "Demonstrate an advanced understanding of physical, chemical and ecological processes, and their coupling in environmental systems;",
            "Design solutions to environmental engineering challenges that take into account environmental, safety, ethical, sustainability, legal and economic considerations;",
            "extend knowledge in Environmental"
        ],
        "Level1Units": [
            "CHEM1001",
            "GENG1000",
            "GENG1010",
            "GENG1014",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2401",
            "ENSC2004",
            "ENVE2013",
            "ENVE2606",
            "ENVE2607",
            "ENVT2251",
            "GENG2000",
            "GENG2010",
            "GENG2012",
            "GEOG2201"
        ],
        "Level3Units": [
            "ENVE3402",
            "ENVE3403",
            "ENVE3405",
            "ENVE3608",
            "ENVE3609",
            "GENG3000"
        ],
        "Level4Units": [
            "ENVE4401",
            "ENVE4601",
            "ENVE5502",
            "ENVE5551",
            "ENVE5552",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5501"
        ]
    },
    "MJD-EMECH": {
        "Name": "Mechanical Engineering",
        "Description": "Mechanical engineering is one of the oldest and broadest of engineering disciplines and it is the backbone of industry worldwide. It involves the production and use of heat and mechanical power for the design, production, and operation of machines and tools. Mechanical Engineering at UWA has been designed to produce graduates who have a solid foundation in the science and mathematics that underpin the discipline, a detailed understanding of the core subject areas within the discipline, and the skills to apply that knowledge in varied and changing environments.  You will have the skills to learn and apply new specialised knowledge in emerging fields involving new technologies.",
        "Outcomes": [
            "Demonstrate a strong foundation in mechanical engineering science by solving technical problems relevant to the field;",
            "Formulate engineering design solutions that accommodate technical, social, ethical, cultural, safety and economic factors and constraints;",
            "Communicate ideas in appropriate ways to a variety of audiences;",
            "Function ethically, effectively, collaboratively, inclusively and professionally in teams; and",
            "demonstrate mastery of the fundamentals of mechanical engineering sufficient to acquire and apply new skills and knowledge throughout their careers.."
        ],
        "Level1Units": [
            "ENSC1004",
            "GENG1000",
            "GENG1010",
            "GENG1101",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2401",
            "ENSC2003",
            "ENSC2004",
            "GENG2000",
            "GENG2003",
            "GENG2004",
            "MECH2002",
            "MECH2004"
        ],
        "Level3Units": [
            "GENG3000",
            "GENG3402",
            "GENG3405",
            "MATH3023",
            "MECH3001",
            "MECH3002",
            "MECH3024",
            "MECH3424"
        ],
        "Level4Units": [
            "GENG5010",
            "GENG5507",
            "MECH4426",
            "MECH4429",
            "MECH4502",
            "MECH5551"
        ]
    },
    "MJD-EMINE": {
        "Name": "Mining Engineering",
        "Description": "Mining engineers are responsible for the extraction of minerals from the ground using surface and/or underground mining techniques. They are involved in activities such as deposit evaluation, mine design, mine production and waste disposal. Mining Engineering at UWA produces skilled engineers with an emphasis on the analysis, design and optimisation of complete mining operations (systems) from extraction of the ore to delivery of the final product. The Mining Engineering major covers geology, finance and management, as well as detailed knowledge of surface mining, underground mining, rock mechanics and mine design.",
        "Outcomes": [
            "Design the most appropriate mining approach for any deposit, based on the available data and acknowledging  the associated limitations and risks.;",
            "select the most appropriate operating strategy for any mining organisation,"
        ],
        "Level1Units": [
            "CHEM1001",
            "EART1104",
            "GENG1000",
            "GENG1010",
            "GENG1014",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2401",
            "ENSC2003",
            "ENSC2004",
            "GENG2000",
            "GENG2004",
            "GENG2009",
            "GENG2010",
            "MINE2001"
        ],
        "Level3Units": [
            "GENG3000",
            "MINE3401",
            "MINE3404",
            "MINE3405",
            "MINE3406",
            "MINE3503"
        ],
        "Level4Units": [
            "GENG4403",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505",
            "GENG5507",
            "MINE4001",
            "MINE4502",
            "MINE5501",
            "MINE5551"
        ]
    },
    "MJD-EXHSC": {
        "Name": "Exercise and Health",
        "Description": "This major explores concepts related to physical activity and exercise for health and wellbeing. This major aims to develop knowledge, skills and practical experiences required for careers in physical and health education, health promotion, health services and fitness industries.  This major also complements other science areas, potentially leading to postgraduate professional training. When taken with the Sport Science major, you may apply to become an accredited exercise scientist upon graduation.",
        "Outcomes": [
            "Understand the relationship between human structural, functional and behavioural characteristics and our ability to develop, maintain and promote a fit and healthy lifestyle throughout the lifespan;",
            "Apply this knowledge in the assessment of health indicators and the prescription of exercise for apparently healthy individuals;",
            "Demonstrate excellence, creativity and intellectual exploration; and",
            "apply relevant critical thinking and communication skills required for employment and further studies related to exercise and health."
        ],
        "Prerequisites": "Mathematics Applications ATAR or equivalent or higher. Students without ATAR mathematics will take a first year mathematics unit.",
        "Level1Units": [
            "PSYC1102",
            "SSEH1101",
            "SSEH1102",
            "SSEH1103"
        ],
        "Level2Units": [
            "SSEH2260",
            "SSEH2270"
        ],
        "Level3Units": [
            "SSEH3301",
            "SSEH3375",
            "SSEH3388"
        ],
        "Level4Units": []
    },
    "MJD-HHMED": {
        "Name": "Humanities in Health and Medicine",
        "Description": "In order to be effective, health care professionals need to understand not only the workings of the body from a scientific perspective, but also to know how people and societies function, and the art and science of caring for people. A caring health professional is assisted by interpretive ability and insight, applies ethical sensitivity and has an awareness of their own values and attitudes. The aim of this major is to prepare individuals working across the health professions for caring for poeple through bringing together the traditions of humanities, inquiry, compassion, and judgment to bear on the management and on the promotion of health and the treatment of illness. Those traditions include the many ways cultures have of representing, narrating, analyzing, knowing, and organizing health, illness, treatment and human interactions.",
        "Outcomes": [
            "Demonstrate understanding of the historical, cultural, religious and political contexts of theories and practices related to health and medicine"
        ],
        "Prerequisites": "Students who have not achieved a scaled mark of at least 50 in ATAR Mathematics Applications or equivalent or higher, will need to successfully complete MATH1720 Mathematics Fundamentals in their first 48 points of study in this course.",
        "Level1Units": [
            "MATH1720"
        ],
        "Level2Units": [
            "BMED2001"
        ],
        "Level3Units": [
            "BMED3001",
            "BMED3002",
            "BMED3003"
        ],
        "Level4Units": []
    },
    "MJD-DENTS": {
        "Name": "Integrated Dental Sciences",
        "Description": "This extended major will encompass a wide range of disciplines within the health and medical sciences. It will provide students with the background knowledge across all the biomedical scientific disciplines including, anatomy, physiology, biochemistry, genetics, immunology, haematology, microbiology, pathology, pharmacology and public health. These disciplines will be integrated within level 3 units, where science, clinical and professional content will be presented longitudinally and built around the core clinical conditions and presentations. Communication and research skills for the health professional will be presented throughout the major. The major will include studies on aspects of Australian society and culture, including Aboriginal health and migrant and refugee health.",
        "Outcomes": [
            "Demonstrate an understanding of the basic human body plan, its biochemistry, anatomy histology, physiology, cell biology and communication systems;",
            "Describe the development, structure and function of the body's cardiovascular, respiratory, renal, neurological, epidermal, cardiovascular, endocrine, haematological and immunological systems;",
            "Describe the development, structure and function of the body's sensory organs;",
            "Describe the common disorders of the various body systems and the sensory organs;",
            "Explain the basic body defences and the processes of cell injury, inflammation and healing;",
            "Demonstrate knowledge of blood and blood pathologies;",
            "Define and describe the major classes of infectious diseases, the sources and characteristics of their pathogens, and the relevant treatment approaches;",
            "Demonstrate knowledge of metabolic function and its integration with nutrition;",
            "Explain human embryology and development;",
            "Demonstrate an understanding of fundamental genomics and genetics;",
            "Explain the association between genetics and disease, including cancer;",
            "Explain the principles of drug delivery, drug metabolism and the associated pharmacological aspects of the common medications used in dental practice;",
            "Explain the clinical signs, symptoms and pathogenesis of systemic conditions relevant to dental practice and the measures required to manage them during dental treatment;",
            "Classify the most common medical emergencies in dental practice and their management;",
            "Discuss aspects of public and population health, epidemiology, and the health care systems in australia;",
            "Demonstrate an understanding of aboriginal, migrant and refugee health;",
            "Demonstrate an understanding of religious, social and cultural differences within australia;",
            "Explain strategies for health maintenance, promotion, screening and disease prevention;",
            "Discuss the importance of appropriate communication in the health professions;",
            "Explain the formation, composition, function, pathology, virulence and control strategies of dental biofilms, including biofilm-related gingivitis;",
            "Outline the dental caries process, its diagnosis and management;",
            "Appraise the biomaterials used for dental restorations, their properties and indications for use;",
            "Explain dental occlusion and how it relates to dental practice;",
            "Demonstrate manual skills in pre-clinical operative dentistry and periodontics;",
            "Explain professionalism, ergonomics, ethics, and infection prevention and control protocols in clinical dental practice; and",
            "outline the principles of research design and evidence-based dental practice and statistical analyses."
        ],
        "Prerequisites": "(1A) Mathematics Applications ATAR or equivalent or higher; or",
        "Level1Units": [
            "CHEM1003"
        ],
        "Level2Units": [
            "IMED2001",
            "IMED2002",
            "IMED2003",
            "IMED2004"
        ],
        "Level3Units": [
            "DENT3001",
            "DENT3002",
            "DENT3003",
            "DENT3004",
            "DENT3005",
            "DENT3006",
            "DENT3007",
            "DENT3008"
        ],
        "Level4Units": []
    },
    "MJD-PLMED": {
        "Name": "Pathology and Laboratory Medicine",
        "Description": "This discipline concerns the testing, diagnosis, treatment, management and prevention of human disease. As a diagnostic specialty, Pathology and Laboratory Medicine can be considered the basis of modern scientific medical knowledge and plays a critical role in evidence-based medicine. This major will provide you with a thorough understanding of the scientific basis of diagnosing, treating and preventing human disease, as well as an appreciation of how medical research forms new insights into disease every day.",
        "Outcomes": [
            "Describe the fundamental processes of pathology including cell injury, inflammation, repair, regeneration, immunopathology and neoplasia;",
            "Describe how the fundamental processes of pathology contribute to the initiation, perpetuation and resolution of human disease;",
            "Describe the influence of development, genetics, environment and infectious organisms on human disease processes; and",
            "integrate and apply the principles of pathology and laboratory medicine to a wide array of human diseases, including those of the cardiovascular, respiratory, gastrointestinal, urinary, reproductive, nervous, neuromuscular, immune and endocrine systems."
        ],
        "Prerequisites": "Student who have not achieved a scaled mark of at least 50 in ATAR Chemistry or equivalent, are required to successfully complete CHEM1003 Introductory Chemistry in their first 48 points of study in their course.",
        "Level1Units": [
            "ANHB1102",
            "SCIE1106"
        ],
        "Level2Units": [
            "MICR2209",
            "PATH2210",
            "PATH2211",
            "PATH2220"
        ],
        "Level3Units": [
            "MICR3305",
            "PATH3305",
            "PATH3308",
            "PATH3309"
        ],
        "Level4Units": []
    },
    "MJD-PPHLH": {
        "Name": "Public Health",
        "Description": "Health is a major modern challenge because of the growing importance of international health issues, the ageing population and disparities in health across the community. As a student you will investigate social, economic, environmental, historical, political, physical and biological influences on health, how these factors interact and how good management can improve the health of communities. Your studies will focus on how health might be improved locally and globally, particularly through disease prevention and health enhancement. This major develops your understanding of the prevention of acute, chronic and general ill health and the promotion of good health through community programs/interventions and the provision of effective health services. There is an emphasis on current and emerging health issues. The Public Health major complements a wide range of disciplines such as biomedical sciences, commerce or economics, enabling you to develop expertise in relevant health applications, health administration or health economics.",
        "Outcomes": [
            "Discuss major health issues locally and globally;",
            "Evaluate biological, cultural, social,environmental, economic, historical and political influences that determine health locally and globally;",
            "Recognise the historical, social, environmental, economic and political contexts that frame public health approaches;",
            "Appraise current and emerging issues in health;",
            "Integrate scientific knowledge and skills to understanding health locally and globally;",
            "Demonstrate knowledge of the socio-cultural context of the health of aboriginal, torres strait islander and other indigenous peoples;",
            "Develop, implement and critically review quantitative and qualitative research relevant to health;",
            "Use evidence-based approaches to health issues;",
            "Critically evaluate approaches to managing health at a population level;",
            "Analyse population health needs and promote healthy behaviours and environments through actions with individuals, communities and society;",
            "Demonstrate the ability to plan and evaluate effective strategies to promote and improve health and evaluate effective ways of delivery;",
            "Describe and compare the organisation and delivery of australian and other health systems;",
            "Critically review and evaluate policies in resource allocation and health systems;",
            "Discuss equity from a population health perspective; and",
            "appraise cultural appropriateness of health strategies."
        ],
        "Prerequisites": "Students who have not achieved a scaled mark of at least 50 in ATAR Mathematics Applications or equivalent or higher, will need to successfully complete MATH1720 Mathematics Fundamentals in their first 48 points of study in this course.",
        "Level1Units": [
            "PUBH1101",
            "PUBH1102"
        ],
        "Level2Units": [
            "AHEA2201",
            "PUBH2203",
            "PUBH2204",
            "PUBH2216"
        ],
        "Level3Units": [
            "PUBH3301",
            "PUBH3302",
            "PUBH3305",
            "PUBH3307"
        ],
        "Level4Units": []
    },
    "MJD-SPTSC": {
        "Name": "Sport Science",
        "Description": "This major provides you with knowledge and skills essential for athlete preparation and specialised fitness industries. You will gain a deeper understanding of the effects of various exercise and training modalities on sport performance. The award-winning sport science practicum provides you with valuable work experience enabling you to integrate theoretical concepts with practical skills in professional settings This major complements the Exercise and Health major, and when taken together, you will be eligible to apply to become an accredited exercise scientist upon graduation.",
        "Outcomes": [
            "Articulate the relationship between human structural, functional and behavioural characteristics and their application in the development and support for athletes and coaches to achieve success in the sporting arena;",
            "Apply knowledge of the assessment of physical, physiological and mechanical characteristics of sports performance, and the prescription of appropriate interventions to maintain athlete strengths and improve weaknesses;",
            "Demonstrate excellence, creativity and intellectual exploration; and",
            "apply relevant employability skills for sport science."
        ],
        "Level1Units": [
            "ANHB1102",
            "PHYL1001",
            "SSEH1101",
            "SSEH1102",
            "SSEH1103"
        ],
        "Level2Units": [
            "SSEH2240",
            "SSEH2250",
            "SSEH2260",
            "SSEH2295"
        ],
        "Level3Units": [
            "SSEH3355",
            "SSEH3365",
            "SSEH3394"
        ],
        "Level4Units": []
    },
    "MJD-SEHDM": {
        "Name": "Sport Science, Exercise and Health",
        "Description": "This course provides a sound basis in sport and exercise science theory combined with practical, technical and communication skills. Completion of the course will expand your options for graduate studies leading to higher qualifications in specialist accredited courses. If you choose this extended major pathway you will be eligible to apply for professional accreditation as an Exercise Scientist with Exercise and Sports Science Australia (ESSA).",
        "Outcomes": [
            "Articulate the relationship between human structural, functional and behavioural characteristics and their application in the development of, and support for, athletes and coaches to achieve success in the sporting arena;",
            "Articulate the relationship between human structural, functional and behavioural characteristics and our ability to develop, maintain and promote a fit and healthy lifestyle throughout the lifespan;",
            "Apply this knowledge in the assessment of physical, physiological and mechanical characteristics of sports performance, and the prescription of appropriate interventions to maintain athlete strengths and improve weaknesses;",
            "Apply this knowledge in the assessment of health indicators and the prescription of exercise for apparently healthy individuals;",
            "Demonstrate excellence, creativity and intellectual exploration; and",
            "apply relevant critical thinking and communication skills required for employment and further studies related to sport science exercise and health."
        ],
        "Prerequisites": "Mathematics Applications ATAR or equivalent or higher. Students without ATAR Mathematics will complete a mathematics unit in their first year",
        "Level1Units": [
            "ANHB1102",
            "PHYL1001",
            "SSEH1101",
            "SSEH1102",
            "SSEH1103"
        ],
        "Level2Units": [
            "SSEH2240",
            "SSEH2250",
            "SSEH2260",
            "SSEH2270",
            "SSEH2295"
        ],
        "Level3Units": [
            "SSEH3301",
            "SSEH3355",
            "SSEH3365",
            "SSEH3375",
            "SSEH3388",
            "SSEH3394"
        ],
        "Level4Units": []
    },
    "MJD-ARIDM": {
        "Name": "Artificial Intelligence",
        "Description": "The Bachelor of Advanced Computer Science (Artificial Intelligence) will equip you with the skills and knowledge to understand, evaluate, design and implement artificial intelligence systems. You'll learn tools and techniques to develop and use artificial intelligence systems make a significant contribution to communities, the success of organisations and the global economy. You will study the philosophical, legal and ethical context for AI in real-world applications.  Working alongside inspiring researchers and industry, you'll get hands-on practice in in a variety of contemporary artificial intelligence techniques, from knowledge representation to deep learning, developing in-demand skills and leadership qualities for an exciting career in AI.",
        "Outcomes": [
            "Acquire the skills and knowledge to understand, evaluate, design and implement artificial intelligence systems;",
            "Apply contemporary artificial intelligence techniques, from knowledge representation, to deep learning;",
            "Discuss the ethical, social and philosophical context for ai technologies as they apply to real world settings;",
            "Work effectively as a team member and a leader for practical ai projects; and",
            "extend knowledge in artificial intelligence through research, experimentation and analysis."
        ],
        "Prerequisites": "ATAR Mathematics Methods",
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "CITS1402",
            "CITS2002",
            "PHIL1001"
        ],
        "Level2Units": [
            "CITS2005",
            "CITS2200",
            "CITS2211",
            "CITS3001",
            "CITS3002",
            "PHIL2008"
        ],
        "Level3Units": [
            "CITS3005",
            "CITS3007",
            "CITS3200",
            "CITS3403",
            "CITS4402",
            "CITS4403"
        ],
        "Level4Units": [
            "CITS4010",
            "CITS4011",
            "CITS4012",
            "CITS4404",
            "CITS5017",
            "CITS5508"
        ]
    },
    "MJD-CMPSC": {
        "Name": "Computer Science",
        "Description": "Computing software and systems are becoming increasingly integral to our lives, revolutionising the world in which we live, work and communicate. This major provides its students with the knowledge and skills required to participate in this revolution. Your studies develop your knowledge of theoretical, algorithmic, implementation and systems principles that underpin computer languages and networks. If you wish to play a role in developing new computing technologies or specialise in enterprise-level programming, systems, software engineering or research careers, then Computer Science is the major for you.",
        "Outcomes": [
            "Identify appropriate data structures and algorithms to solve computational problems;",
            "Design, implement, verify, test, and document robust and secure computer programs;",
            "Apply the knowledge of design and operation of core computer system components to the development of computer systems;",
            "Explain ethical, social and security aspects and constraints of contemporary computer science practice;",
            "Apply team-based software development processes; and",
            "communicate software and systems requirements analysis, design, implementation, testing and documentation clearly in oral and written formats."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year.",
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "CITS1402"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2005",
            "CITS2200",
            "CITS2211"
        ],
        "Level3Units": [
            "CITS3001",
            "CITS3002",
            "CITS3200",
            "CITS3403"
        ],
        "Level4Units": []
    },
    "MJD-CDSDM": {
        "Name": "Computing and Data Science",
        "Description": "Organisations across all industries and sectors are increasingly using data science in information analysis, storage, communication and distribution. In the Bachelor of Advanced Computer Science (Computing and Data Science) you will acquire the computing and data science knowledge and skills to understand and apply appropriate analytical methods to transform the way an organisation achieves its objectives, to deal effectively with large data management tasks, to master the statistical and machine learning foundations on which data analytics is built, and to evaluate and communicate the effectiveness of new technologies; putting you in high demand in the growing data science job market and providing you with many diverse career options as a graduate.  This major will prepare you with practical skills in data science technologies for data collection, cleaning, conversion, analysis, visualisation, interpretation, storage, search, synthesis and cloud management.",
        "Outcomes": [
            "Apply data visualisation, interpretation, storage and synthesis skills in complex real-world settings;",
            "Use predictive modelling to forecast future trends, outcomes and scenarios;",
            "Discuss the opportunities and constraints of contemporary data science practice as it applies in various industries;",
            "Work effectively as a team member and as a team leader for real-world data science projects;",
            "Communicate data science, modelling and analytics clearly in oral, graphical and written formats; and",
            "extend knowledge in data science through research, experimentation and analysis."
        ],
        "Prerequisites": "Mathematics Methods ATAR",
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "CITS1402",
            "PHIL1001",
            "STAT1400"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2005",
            "CITS2200",
            "CITS2402",
            "STAT2401",
            "STAT2402"
        ],
        "Level3Units": [
            "CITS3001",
            "CITS3002",
            "CITS3200",
            "CITS3401",
            "CITS3403",
            "STAT3064",
            "STAT3401"
        ],
        "Level4Units": [
            "CITS4010",
            "CITS4011",
            "CITS5503",
            "CITS5508",
            "STAT4062",
            "STAT4066"
        ]
    },
    "MJD-CYBER": {
        "Name": "Cybersecurity",
        "Description": "Almost every ICT career path encompasses some aspect of cybersecurity. The major in cybersecurity will prepare you for a range of specialist cybersecurity roles using technology, people, information, and processes to enable assured operations in the context of adversaries. With industry integrated learning, you'll gain the practical skills and knowledge to lead the creation, implementation and management of secure computer systems across a range of exciting career paths, protecting people and their data from cyber-attacks.",
        "Outcomes": [
            "Use mathematical, technical and business tools to secure information systems;",
            "Design prevention and mitigation strategies to address cyber security challenges;",
            "Design secure computer systems;",
            "Work effectively as a team member and as a team leader in cybersecurity projects; and",
            "communicate cybersecurity concepts and techniques and results clearly in oral and written formats."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year.",
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "PHIL1001"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2003"
        ],
        "Level3Units": [
            "CITS3002",
            "CITS3006",
            "CITS3007",
            "CITS3200",
            "CITS3403"
        ],
        "Level4Units": []
    },
    "MJD-DATSC": {
        "Name": "Data Science",
        "Description": "Strong computing and data analysis skills are becoming necessary in an ever-increasing number of disciplines and workplace contexts. This major focuses on data and scientific computation including technologies for efficient and effective data collection, conversion, analysis, visualisation, interpretation, storage, search, synthesis and provision through the internet. Many professional organisations use computing resources extensively for information analysis, storage, communication and distribution, providing you with many diverse career options as a graduate. The Data Science major provides students with practical computing and information technology skills.",
        "Outcomes": [
            "Apply computational and statistical techniques to analyse diverse real-world datasets;",
            "Construct data science analyses in incremental and integrated stages;",
            "Explain ethical and social aspects and opportunities and constraints of contemporary data science practice.;",
            "Demonstrate ability to work effectively as a team member and as a team leader;",
            "Communicate data analytics processes and results clearly in oral and written formats in professional and lay terms; and",
            "assess critically alternative solutions for the same data science project."
        ],
        "Prerequisites": "Mathematics Methods ATAR OR Mathematics Applications ATAR with a mathematics unit taken in the first year.",
        "Level1Units": [
            "CITS1401",
            "CITS1402",
            "PHIL1001",
            "STAT1400"
        ],
        "Level2Units": [
            "CITS2402",
            "STAT2401",
            "STAT2402"
        ],
        "Level3Units": [
            "CITS3200",
            "CITS3401",
            "CITS3403",
            "STAT3064",
            "STAT3405"
        ],
        "Level4Units": []
    },
    "MJD-ICYDM": {
        "Name": "International Cybersecurity",
        "Description": "Almost every ICT career path encompasses some aspect of cybersecurity. The Bachelor of Advanced Computer Science (International Cybersecurity) will prepare you for a range of specialist cybersecurity roles with a global perspective. With industry integrated learning, you'll gain the practical skills and knowledge to lead design, implementation and management of secure computer systems across a range of exciting career paths, protecting people and their data from cyber-attacks. The major provides you with strong computing and cybersecurity skills and includes advanced units. You also study contemporary international politics in the context of cybersecurity, providing you with the breadth of understanding that local and global employers are looking for alongside technical knowledge.",
        "Outcomes": [
            "Use mathematical, technical and business tools and an awareness of international political agendas to secure information systems across a range of industries and real world settings;",
            "Design prevention and mitigation strategies to address specific cyber security challenges;",
            "Create secure computer systems;",
            "Work effectively as a team member and as a team leader for real-world cybersecurity projects;",
            "Communicate cybersecurity concepts and techniques and results clearly in oral and written formats;",
            "Extend knowledge in cybersecurity through research, experimentation and analysis; and",
            "discuss the impact of global politics on cybersecurity risk and mitigation strategies."
        ],
        "Prerequisites": "Mathematics Methods ATAR",
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "CITS1402",
            "CITS2211",
            "PHIL1001",
            "POLS1102"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2003",
            "CITS2005",
            "CITS2200",
            "IREL2001"
        ],
        "Level3Units": [
            "CITS3001",
            "CITS3002",
            "CITS3006",
            "CITS3007",
            "CITS3200",
            "CITS3403"
        ],
        "Level4Units": [
            "CITS4010",
            "CITS4011",
            "CITS4403",
            "CITS4419"
        ]
    },
    "MJD-ESOFT": {
        "Name": "Software Engineering",
        "Description": "The field of software engineering is concerned with the development, deployment and maintenance of software assets across an organisation. Software engineers require a diverse set of skills including design, modelling, negotiation, team management, estimation and programming skills. There are opportunities for software engineers in almost every industry, from large government organisations and dedicated software companies, to small start-up companies, or providing software solutions in a variety of fields, such as entertainment, finance, mining, commerce or health. ",
        "Outcomes": [
            "Demonstrate advanced problem solving and programming skills to facilitate software design and implementation;",
            "Apply professional knowledge and skills in software engineering principles, methodologies and practice;",
            "Extend knowledge in computing and software engineering through research, experimentation and analysis; and",
            "understand software risk and promote safe and ethical software engineering practice."
        ],
        "Level1Units": [
            "CITS1003",
            "CITS1401",
            "CITS1402",
            "ELEC1303",
            "GENG1000",
            "GENG1010",
            "MATH1011",
            "MATH1012",
            "PHYS1001"
        ],
        "Level2Units": [
            "CITS2002",
            "CITS2005",
            "CITS2200",
            "CITS2211",
            "GENG2000",
            "STAT2063"
        ],
        "Level3Units": [
            "CITS3002",
            "CITS3005",
            "CITS3007",
            "CITS3200",
            "CITS3301",
            "CITS3403",
            "ELEC3020",
            "GENG3000"
        ],
        "Level4Units": [
            "CITS4419",
            "CITS5501",
            "CITS5503",
            "CITS5507",
            "GENG4411",
            "GENG4412",
            "GENG5010",
            "GENG5505",
            "GENG5507"
        ]
    },
    "MJD-ACCTG": {
        "Name": "Accounting",
        "Description": "Accounting is essential for monitoring and guiding business operations so that managers can gain an accurate and up-to-date picture of the financial health of their organisation. The Accounting major focuses on the preparation, interpretation and communication of accounting information essential for effective decision making within and outside an organisation. You can choose to undertake focused study in either financial or management accounting, pursue professional membership, or complete a more generalised course of study covering a wide range of accounting subjects in greater depth. ",
        "Outcomes": [
            "Demonstrate an understanding of the principles underlying the preparation of financial accounting reports;",
            "Analyse accounting information to evaluate business performance;",
            "Use accounting information for optimal resource allocation within the organisation; and",
            "communicate effectively and succinctly the results of financial analysis."
        ],
        "Level1Units": [
            "ACCT1101",
            "FINA1221"
        ],
        "Level2Units": [
            "ACCT2112",
            "ACCT2201",
            "ACCT2242"
        ],
        "Level3Units": [
            "ACCT3203",
            "ACCT3206",
            "ACCT3302",
            "ACCT3321",
            "ACCT3322",
            "ACCT3323"
        ],
        "Level4Units": []
    },
    "MJD-BUSAN": {
        "Name": "Business Analytics",
        "Description": "This major is for students who wish to develop their knowledge and skills in data analysis within a business context. Students will be given both statistical and computing analytic skills, but will also learn how to apply that to a range of commercial and economic situations. Students will also gain the written and oral communication skills necessary to impart their analysis to a range of business stakeholders.",
        "Outcomes": [
            "demonstrate a core understanding of a range of statistical and data analysis techniques across a range of commercial and economic functions"
        ],
        "Prerequisites": "Business Analytics can  be taken as a degree-specific major in the following degree courses:",
        "Level1Units": [
            "CITS1401",
            "STAT1520"
        ],
        "Level2Units": [
            "ECON2271",
            "FINA2207"
        ],
        "Level3Units": [
            "BUSN3001",
            "ECON3206",
            "WILG3001"
        ],
        "Level4Units": []
    },
    "MJD-BMGMT": {
        "Name": "Business Management",
        "Description": "This major covers the foundations of business and organisational management. This major prepares students for job readiness through a breadth of career and employability pathways relevant to today's dynamic business industries. This major provides students with a grounding in essential business knowledge across technical and theoretical disciplines, including business reporting, economics, marketing and management principles, as well as key practical communications and data literacy skills. To further enhance employability, a capstone experience will be provided to students to put their knowledge into practice through a range of options including internships, industry projects or work-integrated learning. This combination of technical knowledge and skills mean students will be well-equipped to enter a wide range of business organisations upon completion.",
        "Outcomes": [
            "Evaluate  key concepts, theories and practices important to business management;",
            "Diagnose business challenges, and identify appropriate managerial actions;",
            "Demonstrate effective communication skills, both written and oral;",
            "Demonstrate project management skills and ability to work productively in a group;",
            "Provide potential discipline-based solutions to a business; and",
            "demonstrate understanding regarding principles of ethical behaviour, and/or cultural, social and sustainability issues."
        ],
        "Prerequisites": "Business Management can  be taken as a degree-specific major in the following degree courses:",
        "Level1Units": [
            "MGMT1136",
            "MKTG1203"
        ],
        "Level2Units": [
            "HRMT2237",
            "INMT2232",
            "MKTG2238"
        ],
        "Level3Units": [
            "MGMT3347",
            "MKTG3306"
        ],
        "Level4Units": []
    },
    "MJD-ENTIN": {
        "Name": "Enterprise and Innovation",
        "Description": "Enterprise and Innovation is for students to develop their skills, knowledge and practical engagement with the principles of entrepreneurship and innovation in a local and global context. Students will develop solution-based skills to complex real world problems and learn to critically apply business solutions to them.  Students will develop key attributes for employability through core principles of innovation, commercialisation and digital strategies necessary in today's workplace.",
        "Outcomes": [
            "Apply relevant knowledge and skills for managing innovation trajectories in existing firms as well as entrepreneurial processes in a start-up and scaling setting.;",
            "Develop an enduring capacity for framing and solving complex business problems by a focused evidence-based approach rooted in entrepreneurial inquiry.;",
            "Be a proactive communicator, open to feedback from a broad range of stakeholders and critical in your interpretation of diverse cues.;",
            "promote an innovation culture and work effectively in (self)-managed teams."
        ],
        "Prerequisites": "Enterprise and Innovation can only be taken as a degree-specific major in the following degree courses:",
        "Level1Units": [
            "MGMT1136",
            "MKTG1342"
        ],
        "Level2Units": [
            "BUSN2102",
            "MGMT2311"
        ],
        "Level3Units": [
            "MKTG3303",
            "MKTG3314"
        ],
        "Level4Units": []
    },
    "MJD-FINCE": {
        "Name": "Finance",
        "Description": "The Finance major builds on the foundations of finance from the perspective of a functioning organisation. The major includes corporate finance issues such as the appropriate mix of equity and debt to finance projects, identifying the optimal dividend policy, and the resourceful selection of business projects. You can also learn aspects of investment finance including risk and return trade-offs, workings of the capital markets, investment products and investment portfolios, and appropriate risk management techniques. The Finance major can be combined with a major in Economics if you are interested in pursuing a career as a financial economist.",
        "Outcomes": [
            "Understand and explain the basis for optimal portfolio construction;",
            "Apply modern investment theory to the evaluation of projects;",
            "Appreciate the value and limitations of financial instruments such as options and futures;",
            "Identify and use appropriate risk management techniques; and",
            "engage in critical debate on contentious issues in finance such as the validity of the efficient markets hypothesis and the role of corporate governance."
        ],
        "Level1Units": [
            "ACCT1101",
            "FINA1221"
        ],
        "Level2Units": [
            "FINA2222"
        ],
        "Level3Units": [
            "FINA3324"
        ],
        "Level4Units": []
    },
    "MJD-GLBUS": {
        "Name": "Global Business",
        "Description": "In the Global Business major, students will learn to identify the key external and internal factors that influence the management of global organisations, and demonstrate how major management functions and skills vary as a result of managing organisations globally. Students will be able to recognise why and how ethics and corporate social responsibility vary when managing organisations globally as well as identify the key contextual issues affecting the formulation and implementation of a global business venture, and articulate appropriate responses to specific global business issues. Students will demonstrate an understanding of how personal and cultural values are related and differ within and across countries, and evaluate how people and their consumption are shaped by their environment and personal experiences and communicate and work with people from diverse cultures;",
        "Outcomes": [
            "Evaluate  key concepts, theories and practices important to the management of multinational organisations;",
            "Identify possible  solutions for the unique challenges that stem from operating in different global contexts simultaneously;",
            "Demonstrate an understanding of cross-country diversity with respect to cultural, economic, legal and political characteristics;",
            "Demonstrate an understanding of how managing employees varies as a result of different cultural backgrounds; and",
            "Explain how principles of ethical behaviour and social responsibility differ and are applied across different cultural contexts."
        ],
        "Prerequisites": "Global Business can only be taken as a degree-specific major in the following degree courses:",
        "Level1Units": [
            "BUSN1103",
            "MGMT1136"
        ],
        "Level2Units": [
            "ECON2105",
            "MGMT2341"
        ],
        "Level3Units": [
            "EMPL3301",
            "MGMT3304",
            "MKTG3312"
        ],
        "Level4Units": []
    },
    "MJD-HRSMT": {
        "Name": "Human Resource Management",
        "Description": "Human Resource Management explores how the proper management of employees contributes towards organisational effectiveness. This major provides you with thorough theoretical and practical grounding in the management of people and employment in Australia and overseas. You will complete study in areas including organisational behaviour, employment relations systems and processes, human resource planning, recruitment and selection, performance management, training and development, occupational health and safety, work organisation, negotiation and conflict resolution, giving you valuable skills as an employee in any given industry.",
        "Outcomes": [
            "Evaluate and understand key concepts, theories and practices relevant to the effective management of people in the workplace;",
            "Understand the role and value of the human resource management function in supporting business strategies and generating competitive advantage;",
            "Analyse and comprehend national and international issues associated with industrial conflict and the management and regulation of employment relations;",
            "Understand principles of ethical behaviour and social responsibility as they apply to the management of people and employment relations in contemporary organisations;",
            "Use effective communication skills, both written and oral; and",
            "engage in research-based enquiry into issues, topics and problems relating to the study and practice of human resource management and employment relations."
        ],
        "Level1Units": [
            "MGMT1135",
            "MGMT1136"
        ],
        "Level2Units": [
            "EMPL2202",
            "HRMT2237"
        ],
        "Level3Units": [
            "EMPL3241",
            "EMPL3270",
            "HRMT3344",
            "HRMT3345"
        ],
        "Level4Units": []
    },
    "MJD-MGMNT": {
        "Name": "Management",
        "Description": "The management major provides you with a comprehensive understanding of managing organisations effectively within different economic, social, political and legal contexts. You will develop conceptual and practical skills in the areas of organisational behaviour; leadership; operations and project management; information systems management; learning and innovation; management in local and international environments; small business management; entrepreneurship; and strategic management. ",
        "Outcomes": [
            "Evaluate and understand key concepts, theories and practices important to the management of organisations;",
            "Diagnose organisational situations and problems, and identify appropriate managerial actions that will enhance organisational effectiveness;",
            "Understand principles of ethical behaviour and social responsibility as they apply to management decision making in contemporary organisations;",
            "Use effective communication skills, both written and oral; and",
            "engage in research-based enquiry into management-related issues, topics and problems."
        ],
        "Level1Units": [
            "MGMT1135",
            "MGMT1136"
        ],
        "Level2Units": [
            "MGMT2302"
        ],
        "Level3Units": [
            "EMPL3270",
            "MGMT3304",
            "MGMT3308",
            "MGMT3335",
            "MGMT3342",
            "MGMT3346",
            "MGMT3347"
        ],
        "Level4Units": []
    },
    "MJD-MRKTG": {
        "Name": "Marketing",
        "Description": "Discover the real world of marketing that lies behind advertising jingles. Marketing has a central role in understanding what different types of people in different places across the globe want. This major provides you with the knowledge, experience, and skills to become a dynamic marketer in an ever-changing world. Equally practical and theoretical, our marketing teachers are researchers who help you to understand the role of marketing, through curiosity, creativity, analysis, evidence, and innovation. We cover branding, content marketing, marketing analytics, social media marketing, and search engine marketing, to name just a few topics.",
        "Outcomes": [
            "Apply the various components of the marketing mix to create customer value;",
            "Critically analyse customer decision making and customer-facing interactions;",
            "Demonstrate skills in researching and analysing market opportunities; and",
            "evaluate both personal and an organisation's communication strategies."
        ],
        "Level1Units": [
            "MKTG1203",
            "MKTG1204"
        ],
        "Level2Units": [
            "MKTG2305"
        ],
        "Level3Units": [
            "MKTG3306"
        ],
        "Level4Units": []
    },
    "MJD-WKERL": {
        "Name": "Work and Employment Relations",
        "Description": "The Work and Employment Relations major focuses on the dynamics of workplace relations between employers and employees as well as the wider impact of employment relations on the economy, society and politics. You will study how work is organised, the way employees are managed, the role of unions, how cooperation and negotiation can be developed, and how conflict can emerge and be managed. The nature of employment relations in both Australia and other countries is examined using institutional and sociological perspectives.",
        "Outcomes": [
            "Evaluate and understand key concepts, theories and practices in employment relations as well as have an understanding of perspectives on the transformation of work and society drawn from relevant social (sociology, labour studies) and legal studies (employment law) disciplines;",
            "Apply relevant theories to practical contexts and issues;",
            "Understand the interests of workers, unions, managers, employers and the state within the workplace and the broader social context of work;",
            "Understand how to formulate appropriate responses to relevant policy and managerial issues;",
            "Understand principles of ethical behaviour and social responsibility in contemporary organisations and society;",
            "Use effective communication skills, both written and oral; and",
            "work and manage teams."
        ],
        "Level1Units": [
            "EMPL1101",
            "EMPL1206"
        ],
        "Level2Units": [
            "EMPL2202",
            "EMPL2309"
        ],
        "Level3Units": [
            "EMPL3208",
            "EMPL3241",
            "EMPL3270",
            "EMPL3301"
        ],
        "Level4Units": []
    },
    "MJD-ANHBY": {
        "Name": "Anatomy and Human Biology",
        "Description": "What is it that makes us human? The Anatomy and Human Biology major allows you to explore what it means to be human in an integrative way, combining studies of, behaviour and biology of human beings with current social and ethical issues. The units offered within this major cover topics as diverse as human functional anatomy; genetics, variation and evolution; reproduction, embryology and growth; microscopic structures of cells and tissues; structure and function of the nervous system; ecology, behaviour and biosocial interactions. Students explore all of these from the molecular to the population level and beyond.",
        "Outcomes": [
            "demonstrate an understanding of human biology from the perspectives of evolution, genetics, behaviour, ecology, development, structure, function and comparative studies."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher , or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units",
        "Level1Units": [
            "ANHB1101",
            "ANHB1102",
            "SCOM1101"
        ],
        "Level2Units": [
            "ANHB2212",
            "ANHB2214",
            "ANHB2215",
            "ANHB2216"
        ],
        "Level3Units": [
            "ANHB3310",
            "ANHB3315",
            "ANHB3316",
            "ANHB3320",
            "ANHB3321",
            "ANHB3322",
            "ANHB3323",
            "ANHB3324"
        ],
        "Level4Units": []
    },
    "MJD-BCHMB": {
        "Name": "Biochemistry and Molecular Biology",
        "Description": "What are genes? How do hormones work? What goes wrong in a cancer cell? If these questions are of interest, then the Biochemistry and Molecular Biology major may be for you. Biochemists and molecular biologists are interested in the molecular functions of all living organisms, from the smallest bacterium to the largest whale. In this major, students study the way molecules are organised and how they interact to achieve the functions of the living cell and that of the organism. Your investigations cover three main areas: the information stored in DNA; molecular interactions; and how organisms gain and use energy.",
        "Outcomes": [
            "Demonstrate an in-depth understanding of the theoretical basis of biochemistry and molecular biology;",
            "Demonstrate critical analysis and the application of scientific method to biochemical problems;",
            "Demonstrate technical competency in basic laboratory skills including solution preparation, qualitative and quantitative analytical methods, and operation of general laboratory equipment;",
            "Effectively communicate biochemical and molecular biological knowledge in both written and oral forms; and",
            "demonstrate competency in high-level critical thinking and communication skills suited to gaining employment in the field of  biochemistry and molecular biology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "CHEM1001",
            "SCIE1106"
        ],
        "Level2Units": [
            "BIOC2001",
            "BIOC2002"
        ],
        "Level3Units": [
            "BIOC3001",
            "BIOC3002",
            "BIOC3003",
            "BIOC3005"
        ],
        "Level4Units": []
    },
    "MJD-BCNDM": {
        "Name": "Biochemistry of Nutrition",
        "Description": "Nutritional science is an applied subject that draws information from many biological areas, with much of the science coming from biochemical studies. The Biochemistry of Nutrition extended major is an integrative area of study that combines physiology, human biology, microbiology, chemistry, molecular biology, and biochemistry and applies these sciences specifically to the study of health, diet, nutrition, disease, and the connections that exist among them. This extended major includes studies of nutrients, food constituents and their function regarding humans and other mammals, and specifically focuses on nutrient chemical components and how they function biochemically, physiologically and metabolically, as well as their impact on disease. Students will gain an appreciation of the clinical relevance of nutritional biochemistry and the influence of dietary modification and nutritional intervention on physiology and physiological dysfunction.",
        "Outcomes": [
            "Demonstrate an in-depth understanding of required foundational knowledge in biochemistry, molecular biology and physiology;",
            "Understand the biochemical and physiological principles of the processes involved in the digestion and absorption of nutrients, involvement of gut microflora, and impact on human health;",
            "Describe the major metabolic pathways involved in the metabolism of nutrients in the human body and how they relate to disease pathology;",
            "Demonstrate how to research topics, participate in teamwork, seek out information and solve problems in nutritional biochemistry;",
            "Demonstrate technical competency in application of current scientific methodology required to conduct laboratory-based investigations, including experimental design, data collection and interpretation, critical analysis, and operation of laboratory equipment;",
            "Communicate effectively scientific information and analyses of laboratory-based data in written and oral forms; and",
            "apply high-level critical thinking, teamwork and communication and skills required for employment and further studies related to the biochemistry of nutrition."
        ],
        "Prerequisites": "ATAR Mathematics Methods or equivalent or higher or ATAR Mathematics Mathematics Applications with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit. ",
        "Level1Units": [
            "BIOC1001",
            "CHEM1001",
            "PHYL1001",
            "SCIE1106"
        ],
        "Level2Units": [
            "BIOC2001",
            "BIOC2002",
            "PHYL2001",
            "PHYL2002"
        ],
        "Level3Units": [
            "BIOC3001",
            "BIOC3003",
            "BIOC3004",
            "BIOC3005",
            "PHYL3001",
            "PHYL3002",
            "PHYL3003",
            "PHYL3004"
        ],
        "Level4Units": []
    },
    "MJD-BIDEM": {
        "Name": "Biodiversity and Evolution",
        "Description": "The extended major in Biodiversity and Evolution is designed for students interested in understanding the evolution and maintenance of the outstanding biodiversity that exists in Australia, with a special emphasis on Western Australia, a globally recognized hotspot of animal and plant diversity. This major explores the basics of animal and plant biology and how these systems have adapted and diversified in the unique environments found in Australia. It explores how biodiversity arose through the processes of evolution from the molecular genetic to the community levels. ",
        "Outcomes": [
            "Describe the major differences in the development, structure and functioning of animals and plants and explain animal and plant diversity in a phylogenetic context;",
            "Describe broad patterns of global biodiversity and the evolutionary history of australia's biodiversity;",
            "Explain how animals and plants diversity and function in different environments using evolutionary, physiological, ecological and molecular genetic concepts;",
            "Identify timescales and their importance to processes of evolution, environmental change and the dynamics of australian ecosystems;",
            "Describe the crucial relationships among animal and plant physiology, behavior, ecology and evolution;",
            "Demonstrate competence in surveying, sampling and handling wild animals and plants under field conditions;",
            "Demonstrate competence in dissecting physiological systems at the molecular level; and",
            "demonstrate high-level analytical, critical and innovative thinking and communication skills suited to gaining employment in roles related to biodiversity and evolution."
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher, or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "SCIE1104",
            "SCIE1106",
            "SCOM1101"
        ],
        "Level2Units": [
            "ANIM2001",
            "ANIM2207",
            "ANIM2220",
            "ENVT2250",
            "GENE2230",
            "GENE2250",
            "PLNT2204"
        ],
        "Level3Units": [
            "ANIM3361",
            "ANIM3363",
            "ANIM3365",
            "BIOL3364",
            "GENE3350",
            "PLNT3306"
        ],
        "Level4Units": []
    },
    "MJD-BOTNY": {
        "Name": "Botany",
        "Description": "Botany is the scientific study of plants—from their structure and function to their indispensable roles in ecosystems and the intricacies of their cell function. Botanists study how plants evolve and adapt to changing climates and environments and have a proactive role in mitigating the loss of biodiversity. Botany is an ideal major if you are enthusiastic about Western Australia's unique native flora or agricultural crops, and are interested in addressing current and future threats to plant conservation and sustainability. It is envisaged that there will be up to three overnight field trips (there will be a cost of up to \\$500 to cover food and accommodation for around 10 nights, to be borne by the student).",
        "Outcomes": [
            "Understand plant structure, function, diversity and evolution;",
            "Appreciate the pivotal relationship between plants and their environment;",
            "Demonstrate a knowledge of basic plant processes at different levels of organisation including cells, tissues, organs, organisms, populations and communities;",
            "Be conversant in the terminology, issues and practice of the core principles of botany—diversity, ecology, genetics and evolution, and physiology; and",
            "apply relevant employability skills for botany."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ENVT2250",
            "GENE2250",
            "PLNT2201",
            "PLNT2204"
        ],
        "Level3Units": [
            "BIOL3364",
            "ENVT3363",
            "PLNT3301",
            "PLNT3306"
        ],
        "Level4Units": []
    },
    "MJD-CHEMY": {
        "Name": "Chemistry",
        "Description": "Chemistry is one of the central disciplines studied by scientists as it covers essential understanding for virtually all areas of modern science. Chemistry encompasses the preparation and investigation of molecules and materials to the exploration of their properties. Do you want to contribute to the major advances being made in pharmaceuticals, catalysis, new materials, industrial manufacturing, nanotechnology, clean energy and solving environment problems? Studying Chemistry provides both a foundation in and detailed understanding of fields including chemical reactions and processes, catalysis, green chemistry, chemical engineering, natural products, food science, cosmetic and fragrance industries, materials science, nanotechnology, biochemistry, molecular biology and the environment. In the Chemistry Major students will develop an understanding of complex reactions, the mechanisms of reactions and the physical and chemical manipulations that can be used to make reactions occur. Students will also develop an understanding of chemistry in the energy sector, environmental processes, thermodynamics, kinetics, chemical equilibrium and the properties of materials. A major in Chemistry will complement majors in other disciplines such as biochemistry and molecular biology, pharmacology, engineering science, environmental science, geology and physics.",
        "Outcomes": [
            "Devise and test hypotheses, analyse chemical data;",
            "Interpret experimental results and present outcomes in oral and written formats;",
            "Write coherent reports and prepare and deliver coherent presentations, using appropriate software as required;",
            "Apply the literature to perform experiments and understand current practices in chemistry;",
            "Solve basic chemical problems (e.g. calculations of yields, dilutions, stoichiometry in chemical reactions);",
            "Demonstrate knowledge and understanding of principles of chemical safety;",
            "Explain the properties of common classes of chemicals and materials;",
            "Demonstrate knowledge of for e.g. chemical kinetics, thermodynamics, spectroscopy, reaction mechanisms, equilibria and periodic properties; and",
            "apply relevant employability skills for chemistry."
        ],
        "Prerequisites": "Chemistry ATAR or equivalent and Mathematical Methods ATAR or equivalent or higher",
        "Level1Units": [
            "CHEM1001",
            "CHEM1002",
            "SCOM1101"
        ],
        "Level2Units": [
            "CHEM2101",
            "CHEM2102",
            "CHEM2103",
            "CHEM2104"
        ],
        "Level3Units": [
            "CHEM3101"
        ],
        "Level4Units": []
    },
    "MJD-CONBI": {
        "Name": "Conservation Biology",
        "Description": "If you are interested in gaining skills in research and management that protects and restores the world's biodiversity and ecosystems, then Conversation Biology is the major for you. In this major, you will gain theoretical and practical knowledge and skills to understand and minimise the human impacts on natural ecosystems and biodiversity. WA is an ideal living laboratory for your studies with diverse ecosystems stretching from the arid to tropical zones, and including WA's South West region which is considered one of the world's 36 'biodiversity hotspots'. In this major, you will undertake several field trips including one to the highly diverse South Coast Region near Albany and interact with world experts in conservation sciences.",
        "Outcomes": [
            "Understand global biodiversity and its distribution, the evolutionary history of biodiversity in australia, and particular species and communities that are highly threatened;",
            "Appreciate the crucial relationship between species biology and ecology and vulnerability to environmental change;",
            "Discuss major threats to biodiversity, their causes, and management and research mitigating them;",
            "Explain the role of different stakeholders in shaping policy and decision-making;",
            "Demonstrate the necessary analytical and communication skills to participate in modern conservation research; and",
            "demonstrate competency in  fieldwork study, report writing, oral presentation and team work skills suited to gain employment in Conservation Biology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "BIOL2261",
            "ENVT2221",
            "ENVT2250",
            "GEOG2201"
        ],
        "Level3Units": [
            "ANIM3353",
            "BIOL3360",
            "BIOL3364",
            "GEOG3303"
        ],
        "Level4Units": []
    },
    "MJD-FRODM": {
        "Name": "Frontier Physics",
        "Description": "Contemporary physics is built on a broad base of deep theoretical ideas that have been verified with astonishing precision by the most intricate and challenging experiments known to mankind.  This major aims to provide students with a sound grounding in the fundamental theories, conceptual framework, computational techniques as well as experimental skills in frontier physics. The rewards for this major range from the profound satisfaction of understanding the universe at its smallest and largest scales, right through to engaging careers in research, teaching, or technical development in industry.",
        "Outcomes": [
            "Explain the physical concepts and principles that underpin a wide range of applications at the level of an early-career scientist;",
            "Apply problem identification, exploration and solution skills in physical situations that range from simple to complex;",
            "Utilise appropriate mathematical sophistication in the expression and communication of physical concepts;",
            "Investigate physical, numerical and theoretical problems using appropriate computational techniques;",
            "Experimentally test concepts in advanced and frontier physics using appropriate statistical techniques;",
            "Evaluate arguments based on known physics to test their validity; and",
            "apply research methods, including ethical considerations, to a specific research project or topic."
        ],
        "Prerequisites": "MJD-PHYSC Physics (ID 1585)",
        "Level1Units": [
            "CITS1401",
            "MATH1011",
            "MATH1012",
            "PHYS1100",
            "PHYS1200"
        ],
        "Level2Units": [
            "MATH2501",
            "PHYS2001",
            "PHYS2002",
            "PHYS2100"
        ],
        "Level3Units": [
            "PHYS3001",
            "PHYS3005",
            "PHYS3011",
            "PHYS3012",
            "PHYS3100",
            "PHYS3101"
        ],
        "Level4Units": []
    },
    "MJD-GENET": {
        "Name": "Genetics",
        "Description": "Genetics is the study of biologically inherited traits as diverse as those that cause human disease, allow a rare plant to live in a single, isolated location, or result in a desirable characteristic found in a domestic animal used in agriculture. Your studies in genetics involve the analysis of DNA and the many ways in which it is expressed. The knowledge acquired by studying the Genetics major is important for study in all biological sciences including agriculture, biochemistry, botany, conservation biology, ecology, medicine, microbiology, molecular biology and zoology. This major delivers a broad overview of the universal principles, potentials and problems associated with DNA-based life, and provides you with the essential skills of a geneticist.",
        "Outcomes": [
            "Appreciate that as genetics is the study of inheritance, it is a cornerstone of the biological sciences;",
            "Demonstrate knowledge of how traits are inherited and the molecular nature of these patterns, how genetic processes control development and disease and are affected by the environment and evolution, and how and why genomes are studied;",
            "Demonstrate oral and written communication skills;",
            "Practise technologies used in various fields of genetics;",
            "Demonstrate skills in critical thinking, experimental design, data analysis and interpretation,and teamwork; and",
            "demonstrate competency in high-level critical thinking and communication skills suited to gaining employment and further studies in the field of genetics."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher  or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "SCIE1106"
        ],
        "Level2Units": [
            "GENE2230",
            "GENE2250"
        ],
        "Level3Units": [
            "GENE3340",
            "GENE3350",
            "GENE3370"
        ],
        "Level4Units": []
    },
    "MJD-GECDM": {
        "Name": "Geochemistry",
        "Description": "Geochemistry is the application of chemistry to understanding Earth's systems and processes. It is very broad in its scope, extending to the deep Earth, its continents and oceans, as well as to the atmosphere and biosphere through time. Exploration of other planets also focuses on geochemical characterisation of materials to understand planetary evolution. Geochemistry is also widely applied to exploration for a wide range of resources, especially in Western Australia. This extended major focuses on enabling students to gain critical skills in earth science and chemistry to take advantage of employment opportunities arising from technological advances. It will also enable students to learn how to gather and apply geochemical data to environmental and mineral exploration and production contexts in an increasingly digital world.",
        "Outcomes": [
            "Demonstrate understanding of key geological concepts and application of knowledge and skills in the interpretation of major geological processes operating at local to global scales;",
            "Demonstrate practical skills in the recognition and interpretation of earth materials, and solve earth science problems using field-based  and laboratory-based skills in analysis and interpretation of geoscientific datasets;",
            "Demonstrate teamwork and professional conduct skills including geological fieldwork and laboratory safety;",
            "explain the properties of common classes of chemicals and materials and demonstrate knowledge of the principles of chemical safety"
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "CHEM1001",
            "CHEM1002",
            "EART1104",
            "EART1105",
            "SCOM1101"
        ],
        "Level2Units": [
            "CHEM2001",
            "CHEM2002",
            "EART2231",
            "EART2232",
            "EART2234"
        ],
        "Level3Units": [
            "CHEM3001",
            "CHEM3002",
            "CHEM3005",
            "CHEM3006",
            "EART3342",
            "EART3343",
            "EART3344",
            "EART3353"
        ],
        "Level4Units": []
    },
    "MJD-GGRPY": {
        "Name": "Geographical Sciences",
        "Description": "Geographical Sciences is the science of place and space, standing at the intersection of natural and social sciences. Geographers study the Earth's landscapes, peoples, places and environments, and how these interact. Understanding and providing solutions to environmental problems and the Worlds big issues requires an understanding of the complex space-time interactions of water, climate and the interdependence between human activities and the natural, economic and cultural environments. ",
        "Outcomes": [
            "Apply geographical concepts as in understanding change in human and physical environments.;",
            "Explain the geographical causes and consequences of major environmental and social issues, including climate change, land degradation, urbanisation and sustainability.;",
            "Apply methods for the investigation and interpretation of spatial processes and patterns in physical and human environments, including the use of gis and remote sensing.;",
            "Communicate geographical perspectives and knowledge effectively to specialist and non-specialist audiences using appropriately selected written, oral and visual means; and",
            "generate, create and produce effective knowledge, and apply practical and technical skills to resolve geographical challenges and questions."
        ],
        "Prerequisites": "ATAR Mathematics Methods or equivalent or higher.",
        "Level1Units": [
            "GEOG1104",
            "GEOG1106",
            "SCIE1104"
        ],
        "Level2Units": [
            "ENVT2220",
            "ENVT2251",
            "GEOG2201",
            "GEOG2202"
        ],
        "Level3Units": [
            "ENVT3306",
            "GEOG3300",
            "GEOG3301",
            "GEOG3303"
        ],
        "Level4Units": []
    },
    "MJD-GEOGY": {
        "Name": "Geology",
        "Description": "Geology is an applied science that aims to understand all aspects of our planet, from Earth's surface to the deep interior. It strives to discover how the Earth system has evolved during the past 4.4 billion years including the origin of continents, oceans, atmosphere and life itself. Geology students learn how to apply knowledge of Earth processes, and the time scales over which these processes operate, to discovering the origin and distribution of important resources such as groundwater, petroleum and minerals, and understanding climate and other environmental changes. As most of Australia's mineral and petroleum resources are in Western Australia, UWA is the ideal place to study Geology. The Geology major is underpinned by the development of fieldwork skills and geological mapping and includes three 7-day field trips to areas in Western Australia (there will be a cost of up to \\$1200 per student, to cover the cost of food and accommodation for ~21 nights).",
        "Outcomes": [
            "Demonstrate knowledge of key geological concepts and major geological processes operating at local to global scales;",
            "Demonstrate relevant practical skills to solve geological problems with emphasis on fundamental field work skills;",
            "Demonstrate developed skills in interpretation and integration of geoscience data to solve geoscience problems;",
            "Demonstrate developed skills in communicating knowledge and interpretations; and",
            "demonstrate competency in fieldwork, critical thinking, analytical and communication skills suited to gaining employment in geoscience."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "EART1104",
            "EART1105",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "EART2231",
            "EART2232",
            "EART2234"
        ],
        "Level3Units": [
            "EART3342",
            "EART3343",
            "EART3344",
            "EART3353"
        ],
        "Level4Units": []
    },
    "MJD-HSNEM": {
        "Name": "Human Science and Neuroscience",
        "Description": "The extended major in Human Sciences and Neuroscience centres on the understanding of human behaviour, combining a strong core of Neuroscience and Physiology with the disciplines of Psychology and Anthropology. The multidisciplinary major offers an excellent preparation for careers in clinical and healthcare settings as well as medical research.",
        "Outcomes": [
            "demonstrate a sound knowledge of basic cell and systems biology and biological chemistry and apply this knowledge to neural cells and systems"
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "ANHB1101",
            "ANHB1102",
            "NEUR1001",
            "PSYC1101",
            "PSYC1102",
            "SCIE1106"
        ],
        "Level2Units": [
            "ANHB2215",
            "ANHB2217",
            "ANHB3321",
            "PHYL2002",
            "PSYC2217"
        ],
        "Level3Units": [
            "ANHB3310",
            "ANHB3323",
            "ANIM3320",
            "NEUR3301",
            "NEUR3302",
            "NEUR3310"
        ],
        "Level4Units": []
    },
    "MJD-HSDEM": {
        "Name": "Human Sciences and Data Analytics",
        "Description": "As the world becomes increasingly globalised, the importance of understanding and respecting cultural and physical differences between individuals becomes critical. The core units within this undergraduate program will provide students with the theoretical framework to understand how biological and cultural variation occurs, what forces shape this variation between and within populations, and how we can use this information to inform us about current social dilemmas and aid in finding solutions. These critical concepts are explored in this extended major via a sequence of units that examine the biology of 'being human' in today's world with an emphasis on how biology and behaviour of humans are influenced by genetic, developmental, ecological and cultural factors; these are complex interactions and often are associated with ‘big data'. ",
        "Outcomes": [
            "Demonstrate an understanding of the evolutionary processes that determine human differences within and between populations;",
            "Apply acquired knowledge to clearly define questions about human evolutionary and behavioural biology and ecology, particularly in relation to the processes by which humans adapt and acclimate to their natural environments;",
            "Acquire knowledge of, and demonstrate, techniques for seeking out information or designing experiments to answer questions related to issues in the fields of human evolutionary and behavioural biology and ecology;",
            "Critically assimilate, analyse and discuss information acquired on social, biological and economic issues from a human evolutionary biology perspective;",
            "Develop an awareness of how the principles of human evolutionary biology can inform the study of human biology, social, and public health policy;",
            "Apply appropriate techniques to the collection, visual presentation, analysis and interpretation of data from a wide range of sources; and",
            "select appropriate mathematical/statistical models for complex biological systems."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "ANHB1101",
            "ANHB1102",
            "PHIL1002",
            "SCIE1106"
        ],
        "Level2Units": [
            "ANHB2215",
            "ANHB2216",
            "GENE2230",
            "STAT2401",
            "STAT2402"
        ],
        "Level3Units": [
            "ANHB3321",
            "GENE3370",
            "STAT3064",
            "STAT3401",
            "STAT3406"
        ],
        "Level4Units": []
    },
    "MJD-IEMDM": {
        "Name": "Integrated Earth and Marine Sciences",
        "Description": "A holistic understanding of Earth and its oceans is needed for a more sustainable future.  This extended major offers you a research-led experience in studying Earth: from the planet's early history to its foreseeable future, and from the ocean floors to the high mountains.  You will learn key skills in the collection and interpretation of geoscientific data, in both terrestrial and marine settings, as well as data analysis and synthesis techniques. These skills will equip you for a future career in federal, state and local government agencies, consultancy and private industry related to minerals, petroleum, groundwater or coastal zone management.",
        "Outcomes": [
            "Collect geoscientific data, on land, at sea, and in the laboratory;",
            "analyse and evaluate data in spatial and spatial-temporal contexts"
        ],
        "Prerequisites": "Mathematics Methods ATAR  or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1131",
            "EART1104",
            "EART1105",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "CITS2401",
            "EART2204",
            "EART2231",
            "EART2232",
            "EART2234",
            "ENVT2251",
            "SCIE2204"
        ],
        "Level3Units": [
            "EART3342",
            "EART3343",
            "EART3353",
            "ENVT3307",
            "ENVT3362",
            "SCIE3304"
        ],
        "Level4Units": []
    },
    "MJD-IMSCP": {
        "Name": "Integrated Medical Sciences and Clinical Practice",
        "Description": "This extended major will encompass a wide range of disciplines within the health and medical sciences. It will provide students the background knowledge across all the biomedical scientific disciplines including, anatomy, physiology, biochemistry, genetics, immunology, haematology, microbiology, pathology, pharmacology and public health. These disciplines will be integrated within level 3 units, where science, clinical and professional content will be presented longitudinally and built around the core clinical conditions and presentations.",
        "Outcomes": [
            "Display professional behaviour in the educational and clinical settings, and outline some challenges to professionalism; outline the principles of reflective practice, recognise personal abilities and difficulties and access support services when necessary; comply with medicolegal responsibilities and outline some bioethical issues in the doctor-patient relationship;",
            "Outline the factors affecting team and group roles, structure, function and goals; and work effectively in a learning group; outline the benefits of interprofessional practice; outline the organisation of the health care system and its delivery in australia including the roles of doctors and medical students;",
            "Outline the basic principles of health advocacy and their application to special and specific needs of individuals, groups, communities and populations; explain the impact of historical, geographical and socio-cultural factors on the health and health care of aboriginal people and communities, and the elements of cultural security for aboriginal people; outline factors contributing to the health and health disparities of individuals, groups and communities including diverse and vulnerable groups, and underserved population; outline principles, strategies and controversies in health maintenance, promotion, screening and disease prevention;",
            "Explain the elements of the medical consultation and physical examination and demonstrate an organised approach to taking a medical history and performing physical examination, explain the principles of clinical reasoning; explain generic principles of patient management including pharmacological and nonpharmacological therapies, and explain the use of therapies for specified organ system medical conditions; demonstrate adherence to infection control and safe patient handling; outline the issues related to the patient's perspectives of health, illness and healthcare experiences; demonstrate appropriate bioscientific vocabulary and display professional, concise and accurate oral, written and electronic biomedical communication skills; define the elements of quality care (safety, efficacy, efficiency, timeliness, patient-centeredness, equity) and medical error;",
            "Outline principles of learning, identify personal learning needs, implement a personal learning plan and effectively use appropriate educational resources; outline effective approaches to developing mentoring relationships from the mentee perspective; outline principles of patient health literacy and sources of health information available to patients; explain adult learning educational principles; display effective self-assessment skills, seek and effectively respond to constructive feedback, and provide constructive feedback to others; and",
            "outline the principles of the scientific method, research study designs, and biostatistics; outline the principles of evidence?based practice and evidence-based processes, tools and systems; evaluate and select reliable, efficient and authoritative sources of medical information to support learning."
        ],
        "Prerequisites": "(1A) Mathematics Applications ATAR or equivalent or higher; or",
        "Level1Units": [
            "IMED1001",
            "IMED1002",
            "IMED1003",
            "IMED1004"
        ],
        "Level2Units": [
            "IMED2001",
            "IMED2002",
            "IMED2003",
            "IMED2004"
        ],
        "Level3Units": [
            "IMED3111",
            "IMED3112"
        ],
        "Level4Units": []
    },
    "MJD-MARCP": {
        "Name": "Marine and Coastal Processes",
        "Description": "Coastlines globally face unprecedented threats from continued development and climate change. Majoring in Marine and Coastal Processes will provide you with the understanding of how our coastal and marine environments operate such that you can apply this knowledge to ensure coastal communities and marine ecosystems remain resilient in the future. Western Australia's coastal and nearshore seascape includes a diversity of morphology, habitats, and environmental forcing which will allow you to gain first-hand experience in the field. You'll learn about the processes that drive coastal changes, the importance of ocean currents in determining our sea level and climate, the links and feedbacks between physical and biological processes, and about strategies to manage the coast as a resource for all. During the course of your studies you will gain practical experience through hands-on laboratory-based exercises, field trips (several of which are overnight) and computer based labs.",
        "Outcomes": [
            "Demonstrate a solid understanding of the physical processes that operate in marine and coastal environments;",
            "Apply scientific principles, incorporating theoretical concepts, keen observation, sound experimental design, analysis and insightful interpretation into marine research;",
            "Demonstrate a knowledge of the linkages and feedbacks between physical and biotic processes;",
            "Explain how the interactions between the physical and biotic components can influence decisions about marine and coastal management;",
            "Conduct quantitative marine research in a safe, ethical and professional manner;",
            "Develop skills in modelling, programming, and numeracy as relevant to marine research; and",
            "apply high-level critical thinking, fieldwork,  teamwork and communication and skills required for employment and further studies in the field of coastal and marine science."
        ],
        "Prerequisites": "ATAR Mathematics Methods or equivalent or higher or ATAR Mathematics Applications  with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "BIOL1131",
            "EART1105",
            "SCIE1104"
        ],
        "Level2Units": [
            "CITS2401",
            "EART2204",
            "ENVT2220",
            "GEOG2201",
            "SCIE2204"
        ],
        "Level3Units": [
            "ENVT3306",
            "ENVT3307",
            "ENVT3362",
            "SCIE3304"
        ],
        "Level4Units": []
    },
    "MJD-MBIOL": {
        "Name": "Marine Biology",
        "Description": "If you are fascinated by our amazing marine plants and animals and the coastal environments in which they live, then Marine Biology is the major for you. Western Australia's marine environment is a biodiversity hotspot with up to 80 per cent of its  fish, invertebrates and other organisms found nowhere else in the world, making WA an ideal living laboratory for your studies. This major includes marine biology and ecology, marine and coastal management, and oceanography. It combines knowledge of marine aquatic life with a solid understanding of the physical environment. Through experimental design and research, you will learn to appreciate the complex interactions that occur in marine ecosystems. During your studies, you will gain practical experience through hands-on laboratory-based exercises, field trips and computer-based labs.",
        "Outcomes": [
            "Critically review the relationship between structure, function and process at all biological levels: molecular, cellular, organismal, population, community and ecosystem;",
            "Apply scientific principles, incorporating theoretical concepts, keen observation, sound experimental design, analysis and insightful interpretation into marine research;",
            "Demonstrate a knowledge of the diversity, life history strategies and functional traits of marine biota;",
            "Explain the ecological relationships between organisms and their environment at a range of spatial and temporal scales and evaluate how these may be altered by climate change;",
            "Explain how the interactions between physical and biotic components can influence decisions about sustainable management;",
            "Develop skills in the use of laboratory and field techniques commonly used in marine biology;",
            "Develop skills in modelling and statistics as relevant to marine research;",
            "Conduct quantitative marine research in a safe, ethical and professional manner; and",
            "demonstrate competency in high-level critical thinking and communication skills suited to gaining employment in marine biology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "EART1105",
            "SCIE1104"
        ],
        "Level2Units": [
            "BIOL2204",
            "ENVT2221",
            "ENVT2250",
            "SCIE2204"
        ],
        "Level3Units": [
            "BIOL3305",
            "ENVT3306",
            "ENVT3307",
            "SCIE3304"
        ],
        "Level4Units": []
    },
    "MJD-MARDM": {
        "Name": "Marine Science",
        "Description": "Western Australia's marine estate is unique globally. It features a vast array of marine and coastal environments, oceanographic conditions, and is a biodiversity hotspot with up to 80 per cent of its fish, invertebrates and other organisms found nowhere else in the world. This makes WA an ideal living laboratory for your marine studies. This extended major will expose you to the full breadth of the marine science discipline, allowing a deeper understanding of both the physical and biological components through the marine biology and marine and coastal processes majors. It combines knowledge of marine life with a solid understanding of the physical process across all coastal marine environments. Through experimental design and research, both in the field and in laboratories, you will learn to appreciate the complex interactions that occur between marine ecosystems and physical processes. During your studies, you will gain practical experience through field trips (several of which are overnight) and computer-based labs. This extended major is the ultimate multi- and interdisciplinary learning environment that will best place you to continue your studies as a postgraduate student or pursue a career in a marine-related discipline after graduation.",
        "Outcomes": [
            "Recognise the relationship between structure, function and process at all biological levels: molecular, cellular, organismal, population, community and ecosystem;",
            "Apply scientific principles, incorporating theoretical concepts, keen observation, sound experimental design, analysis and insightful interpretation, into marine research.;",
            "Demonstrate a knowledge of the diversity, life history strategies and functional traits of marine biota;",
            "Demonstrate a solid understanding of the physical processes that operate in marine and coastal environments;",
            "Demonstrate an understanding of complex interactions between the physical and biotic components of marine environments and the range of scales at which these interactions can occur.;",
            "Recognize how the interactions between the physical and biotic components can influence decisions about marine and coastal management;",
            "Develop skills in computational, mathematical, programming and statistical techniques commonly used in marine research;",
            "Conduct quantitative marine research in a safe, ethical and professional manner; and",
            "demonstrate competency in high-level critical thinking and communication skills suited to gaining employment in marine science."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "EART1105",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "BIOL2204",
            "CITS2401",
            "CITS2402",
            "EART2204",
            "ENVT2221",
            "ENVT2250",
            "GEOG2201",
            "SCIE2204"
        ],
        "Level3Units": [
            "BIOL3305",
            "ENVT3306",
            "ENVT3307",
            "ENVT3362",
            "SCIE3304"
        ],
        "Level4Units": []
    },
    "MJD-MTHST": {
        "Name": "Mathematics and Statistics",
        "Description": "Mathematics is humanity's most powerful tool for comprehending the universe and is essential for many fields of modern endeavour such as science, technology, engineering and finance. It also underlies data analysis, forecasting, modelling, decision-making and problem-solving principles. Mathematicians contribute creatively to almost every aspect of modern life. This major will equip you with the mathematical tools and techniques of at least two of the three key disciplines of pure mathematics, applied mathematics and mathematical statistics.",
        "Outcomes": [
            "Pure mathematics—(a) apply abstract reasoning, rigour and logical deduction; (b) demonstrate an understanding of axiomatic systems and the fundamentals of mathematics; (c) establish the truth of a statement; and (d) write correct and convincing proofs;",
            "Applied mathematics—(a) apply the power of mathematics to model and understand the real world; (b) demonstrate an understanding of continuous and discrete mathematics models, dynamical systems and methods of approximation and simulation; (c) model real-world phenomena in the language of mathematics; (d) reduce a problem to mathematically tractable elements; and (e) evaluate the applicability of a mathematical solution to the original problem; and",
            "statistics—(a) apply appropriate techniques to the collection, visual presentation, analysis and interpretation of data from a wide range of sources; (b) explain the mathematical and practical consequences of chance variation in both the source and collection of data and how to make decisions taking these factors into account; (c) model real-world phenomena involving unpredictable variation in the language of mathematics; (d) select appropriate mathematical/statistical models of data generating mechanisms; (e) use modern statistical computing packages for statistical analysis and simulation."
        ],
        "Level1Units": [
            "MATH1011",
            "MATH1012",
            "SCOM1101"
        ],
        "Level2Units": [
            "MATH2021",
            "MATH2031",
            "STAT2062"
        ],
        "Level3Units": [
            "MATH3002",
            "MATH3021",
            "MATH3022",
            "MATH3024",
            "MATH3031",
            "MATH3032",
            "MATH3033",
            "STAT3061",
            "STAT3062",
            "STAT3063",
            "STAT3064"
        ],
        "Level4Units": []
    },
    "MJD-MCBIM": {
        "Name": "Microbiology and Immunology",
        "Description": "Microbes are organisms too small to be seen without the aid of a microscope and include bacteria, viruses, protozoa, algae and parasites. The study of these organisms and the role they play in health, disease and the environment is known as microbiology, and immunology is the study of how the body defends itself against such organisms. This major covers a range of fields, from the more applied disciplines such as medical, public health, industrial, and food microbiology, to basic fields of immunology, microbial ecology, physiology and genetics of microbes. Your studies will teach you how microbiology can be applied in areas as diverse as medicine, brewing, food spoilage, control of environmental pollution and space science. You will receive a thorough grounding in the scientific basis of microbiology and its applications in the real world. Graduates in Microbiology and Immunology will be eligible for membership in the Australian Society of Microbiology (ASM)—the national scientific and employment body of the profession.",
        "Outcomes": [
            "Describe the fundamental divisions of the microbial world including bacteria, viruses, protozoa, algae and parasites;",
            "Describe the genetic and molecular biological processes involved in their life cycles, and in their pathologic and environmental interactions;",
            "Describe the steps involved in the initiation, perpetuation and resolution of infectious diseases;",
            "Describe the role of the innate and adaptive immune system in these processes;",
            "Integrate and apply principles of microbiology and immunology to understanding a wide array of diseases in the various body systems of humans, such as the cardiovascular and respiratory systems, central nervous system, liver and kidney, gastrointestinal and reproductive tracts;",
            "Describe the role of microbes and their ecology in environmental and industrial processes; and",
            "through laboratory/tutorial exercises, acquire skills in (a) methods relevant to microbiology and immunology; (b) experimental design; (c) data collection, analysis and interpretation; (d) critical thinking skills, integration of concepts, precepts and fundamentals; (e) working independently, as well as in teams; and (f) communication to a high level, of results and analyses in both oral and written forms."
        ],
        "Prerequisites": "Student without WACE Chemistry or equivalent, are required to take CHEM1003 in their first year. ",
        "Level1Units": [
            "BIOL1130",
            "SCIE1106"
        ],
        "Level2Units": [
            "MICR2208",
            "MICR2209"
        ],
        "Level3Units": [
            "MICR3305",
            "MICR3310",
            "MICR3320",
            "MICR3330"
        ],
        "Level4Units": []
    },
    "MJD-MLSDM": {
        "Name": "Molecular Life Sciences",
        "Description": "This extended major has been specifically designed to give an understanding of biological function at the molecular level and how this knowledge integrates into understanding how individual cells and entire organisms function. Emphasis is placed on developing and practicing the laboratory skills and technologies of cutting-edge molecular life sciences. Both theoretical and practical information is presented in the contexts of health sciences and agriculture. Critical thinking; developing and testing hypotheses; and analysing data, including big data, are integrated throughout the degree. Completion of this extended major opens the possibility of a Master in Biotechnology with a choice of specialisations such as Biochemistry and Molecular Biology, Environmental and Agricultural Biotechnology, Genetics and Genomics, or Synthetic Biology. This degree will also serve as an excellent stepping stone into careers in synthetic biology, bioscience, medicine and allied health fields, industry, as well as post-graduate studies in multiple bioscience disciplines.",
        "Outcomes": [
            "Demonstrate an understanding of the current theoretical basis of the molecular life sciences in animals, plants and microorganisms;",
            "Demonstrate an understanding of the dynamics of cellular environments, including biological systems and soils;",
            "Modify experimental protocols;",
            "Critically analyse and interpret experimental results;",
            "Apply techniques and technologies to solve problems in the molecular life sciences;",
            "Effectively communicate in the context of the molecular life sciences in both written and oral forms; and",
            "apply high-level critical thinking, teamwork and communication and skills required for employment and further studies related to molecular life sciences."
        ],
        "Prerequisites": "ATAR Mathematics Methods or equivalent or higher or  ATAR Mathematics Applications  with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "SCIE1104",
            "STAT1400"
        ],
        "Level2Units": [
            "BIOC2001",
            "BIOC2002",
            "CITS2401",
            "ENVT2236",
            "GENE2230",
            "PLNT2201"
        ],
        "Level3Units": [
            "BIOC3001",
            "BIOC3002",
            "BIOC3003",
            "BIOC3005",
            "BIOL3305",
            "GENE3350",
            "GENE3370"
        ],
        "Level4Units": []
    },
    "MJD-NEURS": {
        "Name": "Neuroscience",
        "Description": "How do we process the sensory stimuli we receive? How does the nervous system grow, develop and learn? How do medical conditions such as Alzheimer's disease, deafness, dementia and depression afflict the brain and nervous system? Neuroscientists are interested in the answers to these questions and how nervous system function can be restored after disease and injury to the brain. You will be taught by academics with established international reputations in neuroscience research at all levels—from the molecules that make up individual nerve cells and that transfer information from one nerve cell to another, to the complexities of how behaviour, thought and emotions are produced.",
        "Outcomes": [
            "Demonstrate a sound knowledge of basic cell and systems biology and biological chemistry and apply this knowledge to neural cells and systems;",
            "Recall and integrate key facts and concepts about the structure and function of the nervous systems of humans and other animals;",
            "Conduct some basic anatomical, cellular, physiological and behavioural investigations of nervous tissues and systems;",
            "Summarise the basic neuroscience underpinning common pathological conditions of the nervous systems;",
            "Work productively in small groups in a neuroscience laboratory environment;",
            "Research neuroscience literature and incorporate into a written report on a neuroscience subject;",
            "Explain and critically appraise recent neuroscience literature;",
            "Discuss some current issues in basic or applied neuroscience research and recognise the ongoing expansion of knowledge in these areas;",
            "Be aware of the positive contributions of neuroscience research to health and society;",
            "Be aware of the ethical implications of advances in neuroscience; and",
            "apply high-level critical thinking, teamwork and communication skills required for employment and further studies related to neuroscience."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "NEUR1001",
            "PSYC1101"
        ],
        "Level2Units": [
            "ANHB2217",
            "PHYL2002",
            "PSYC2217"
        ],
        "Level3Units": [
            "ANIM3320",
            "NEUR3301",
            "NEUR3302",
            "NEUR3310"
        ],
        "Level4Units": []
    },
    "MJD-PHARY": {
        "Name": "Pharmacology",
        "Description": "How do medicines produce their beneficial effects on human diseases? How can drugs target particular organs, cells, proteins and genes? This major provides the comprehensive grounding in scientific concepts that you require in order to understand how the body affects the actions, efficacy and safety of drugs, how drugs affect the human body, and how drugs are used to treat human disease. Topics in the units offered include drug–receptor interactions, dose–response relationships, intracellular signalling, drug metabolism and elimination, toxicology, respiratory pharmacology, immunopharmacology, drug discovery and development, as well as the role of genetics in dictating individual responses to drugs. Theoretical content is reinforced by practical laboratory sessions and computer-based workshops.",
        "Outcomes": [
            "Discuss the role of pharmacology in improving health outcomes and addressing current and future health challenges;",
            "Discuss the processes that regulate the fate of drugs in the body;",
            "Discuss drug action at molecular, cellular, tissue and whole-body levels, discriminating between various mechanisms of action of drugs;",
            "Relate therapeutic effects and unwanted adverse effects to drug action, recognising the significance of genetic polymorphism in drug response;",
            "Discuss the development and contribution of advanced technologies to drug design and discovery;",
            "Investigate a problem related to pharmacology through hypothesis formulation, experimental design, and data collection, analysis and interpretation;",
            "Perform laboratory experiments relevant to assessing the action of drugs and their impact on pathophysiological processes;",
            "Select, critically appraise, and communicate scientific information on a topic related to pharmacology;",
            "Work constructively in a team; and",
            "discuss ethical approaches to responsible conduct in learning and research."
        ],
        "Prerequisites": "Student without WACE Chemistry or equivalent, are required to take CHEM1003 in their first year. ",
        "Level1Units": [
            "SCIE1106"
        ],
        "Level2Units": [
            "PHAR2210",
            "PHAR2220"
        ],
        "Level3Units": [
            "PHAR3310",
            "PHAR3311",
            "PHAR3320",
            "PHAR3321"
        ],
        "Level4Units": []
    },
    "MJD-PHYSC": {
        "Name": "Physics",
        "Description": "Physics examines the world around us at the most fundamental level, from the origin and fate of the universe, to the behaviour of matter on subatomic length scales—and everything in between. The overarching objective of the Physics major at UWA is to provide students with access to the frontiers of modern physics via an emphasis on essential mathematical skills. You apply the key pillars of relativity and quantum physics to atomic, molecular, nuclear and particle physics, condensed matter physics, photonics and astrophysics. You understand the role of physics as the driving force behind many advanced technologies, from radar to lasers, from GPS to quantum computers and MRI and PET scanners. The choice of Western Australia as the site for part of the Square Kilometre Array makes the Physics major an exciting prospect.",
        "Outcomes": [
            "Develop increasing levels of conceptual understanding of the physical principles which underpin a wide range of applications;",
            "Develop and apply increasing levels of critical thinking skills in a range of physical situations;",
            "Develop and apply problem identification, exploration and solution skills in physical situations that range from simple to complex;",
            "Apply increasing levels of appropriate mathematical sophistication in the expression and communication of physical concepts;",
            "Develop in-depth understanding of the physical principles of measurement, experimental technique, quantitative analysis and data analysis; and",
            "develop and demonstrate skills relevant to the communication of physics concepts including writing, oral presentations, critical information literacy skills and interpersonal skills."
        ],
        "Prerequisites": "MJD-FRODM Frontier Physics",
        "Level1Units": [
            "CITS1401",
            "MATH1011",
            "MATH1012",
            "PHYS1001",
            "PHYS1002"
        ],
        "Level2Units": [
            "MATH2501",
            "PHYS2001",
            "PHYS2002"
        ],
        "Level3Units": [
            "PHYS3001",
            "PHYS3002"
        ],
        "Level4Units": []
    },
    "MJD-PHYGY": {
        "Name": "Physiology",
        "Description": "How does your body cope during intense exercise, blood loss and dehydration? How does your nervous system respond to the world around you? How does your body adapt to changing environments? The Physiology major provides answers to these questions and teaches you how the human body works, from the molecular and cellular levels to tissues and organs. The course is hands-on with a wide range of practical classes that demonstrate how scientific discovery is achieved and help you develop skills of critical thinking, analysis and even design and conduct your own research experiments. As a physiology graduate, you will ultimately have advanced knowledge of how the body functions, which is central to our ability to detect, prevent and treat disease.",
        "Outcomes": [
            "Recall and integrate key knowledge and concepts about the function of cells, tissues and organs and how their function is coordinated;",
            "Explain a range of physiological phenomena with reference to the underlying fundamental physicochemical processes;",
            "Explain the key elements of the scientific method;",
            "Explain and perform measurements of physiological phenomena from human subjects and animal tissue using a range of measurement equipment;",
            "Work productively in small teams in a physiology laboratory setting;",
            "Analyse and interpret physiological data derived from a range of measurement systems including computer simulations;",
            "Clearly communicate scientific facts and concepts in written and oral form, using standard scientific format and terminology;",
            "Search and critically analyse research literature;",
            "Explain the physiological basis of pathological conditions; and",
            "apply relevant employability skills for physiology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or equivalent or higher or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "PHYL1001"
        ],
        "Level2Units": [
            "PHYL2001",
            "PHYL2002"
        ],
        "Level3Units": [
            "PHYL3001",
            "PHYL3002",
            "PHYL3003",
            "PHYL3004"
        ],
        "Level4Units": []
    },
    "MJD-PLBEM": {
        "Name": "Plant Biology",
        "Description": "Plant Biology is an exciting and rapidly developing subject, with many applications in fields as diverse as agriculture, conservation and environmental biology. In Plant Biology, you will study plants from molecular, cellular, and physiological perspectives and develop an understanding of plant development and reproduction, and how plants interact with their changing environment. In addition, you will study the abundance and diversity of plant species and how these have evolved, using molecular and genetic tools. ",
        "Outcomes": [
            "Describe the development, structure and functioning of plants from the molecular scale through to the whole plant;",
            "Demonstrate competency in scientific methodologies such as filed and laboratory sampling, experimentation and data analysis  in the plant sciences;",
            "demonstrate understanding of the different ways  genome sequencing, genome editing, genome diversity and evolution are used to solve both fundamental and applied problems in the plant sciences"
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics unit.",
        "Level1Units": [
            "BIOC1001",
            "BIOL1130",
            "BIOL1131",
            "SCIE1104",
            "SCIE1106",
            "SCOM1101"
        ],
        "Level2Units": [
            "BIOC2001",
            "ENVT2250",
            "GENE2230",
            "GENE2250",
            "PLNT2201",
            "PLNT2204"
        ],
        "Level3Units": [
            "BIOL3364",
            "ENVT3363",
            "GENE3350",
            "GENE3370",
            "PLNT3301",
            "PLNT3306"
        ],
        "Level4Units": []
    },
    "MJD-PHMSC": {
        "Name": "Podiatric Health and Medical Sciences",
        "Description": "This Extended Major provides the foundation of studies for direct entry in to the Doctor of Podiatric Medicine (DPM) degree for entry into professional practice as a podiatrist. This course prepares graduates with the clinical and professional attributes required for successful entry to practice.",
        "Outcomes": [
            "Explain basic body plan, organisation, histology, physiology, cell communication and cell biology;",
            "Explain basic chemistry, biochemistry, genetics and human heredity;",
            "Integrate knowledge on metabolic function and nutrition, cell cycle and signalling and disregulation causing cancer;",
            "Discuss aspects of public and population health, epidemiology, aboriginal, migrant and refugee health, healthcare systems and resource allocation in australia;",
            "Explain basic body defences, including immune system structure and function, microbials and infection;",
            "Integrate knowledge on blood and blood pathologies, drug delivery and metabolism and associated pharmacological aspects;",
            "Discuss the importance of appropriate communication in the health profession,;",
            "Demonstrate an understanding of religious, social and cultural differences within australia;",
            "Demonstrate basic research skills, including medical research design, evidence and association and statistical analyses;",
            "Demonstrate knowledge of human embryology and development, the human genome and aetiology of disorders associated with genetic abnormalities;",
            "Explain normal human structure, function, behaviour and development of the sensory organs and the cardiovascular, respiratory, renal, neurological, skin and musculoskeletal; nervous and neurological; cardiovascular; respiratory; gastrointestinal; endocrine, haematological and immunological systems;",
            "Explain the common disorders of the sensory organs and the cardiovascular, respiratory, renal, neurological, skin and musculoskeletal; nervous and neurological; cardiovascular; respiratory; gastrointestinal; endocrine, haematological and immunological systems;",
            "Explain the principles of cell injury, inflammation, the healing process, neoplasia, genetics and genetic diseases;",
            "Describe common human pathogenic organisms, the sources of infection, their associated diseases and treatments;",
            "Describe and explain the anatomy, histology, physiology, development, embryology and function of the tissues of the lower limb;",
            "Explain the principles of drug delivery, drug metabolism and associated pharmacological aspects of the common medications used in podiatric practice;",
            "Discuss aspects of public and population health, epidemiology, and primary health care and explain strategies for health maintenance, promotion, screening and disease prevention;",
            "Develop manual and psychomotor skills in pre-clinical simulation exercises;",
            "Demonstrate professionalism, ergonomics, ethics, diversity, cultural awareness and communication skills in clinical podiatric practice;",
            "Demonstrate principles of safe practice, risk assessment, clinical record keeping, infection prevention and control protocols in clinical podiatric practice;",
            "Outline the principles of research design and evidence-based podiatric practice;",
            "Describe the role of the podiatrist within the health care system;",
            "Demonstrate foundational practical podiatric clinical skills in evidence based primary podiatric practice, basic foot assessments and routine care provision;",
            "Describe fundamentals of lower limb biomechanics for podiatric medicine; and",
            "apply medical and podiatric history taking skills and physical lower limb assessment, understanding of the patient's perspective and quality patient-centred care to undertake practical podiatric skills in a clinical environment."
        ],
        "Prerequisites": "(1A) Mathematics Applications ATAR or equivalent or higher; ",
        "Level1Units": [
            "IMED1001",
            "IMED1002",
            "IMED1003",
            "IMED1004"
        ],
        "Level2Units": [
            "IMED2001",
            "IMED2002",
            "IMED2003",
            "IMED2004"
        ],
        "Level3Units": [
            "PODI3000",
            "PODI3111",
            "PODI3112",
            "PODI3113",
            "PODI3114",
            "PODI3115",
            "PODI3116",
            "PODI3117",
            "PODI3118"
        ],
        "Level4Units": []
    },
    "MJD-WLCDM": {
        "Name": "Wildlife Conservation",
        "Description": "The Wildlife Conservation extended major is designed for students interested in the conservation of threatened animals and their environments. The extended major allows you to study animals with a special emphasis on understanding their relative conservation status and options for recovering viable populations of threatened species. Focusing on unique Australian fauna, you will learn about the processes leading to the exceptional biodiversity that exists today, the threats facing this biodiversity and the management strategies and policies that can be used to limit, and in some cases reverse, the impact of these threats. There will be opportunities to study animals living in a diverse range of habitats in Western Australia, from the desert to forests and tropical reefs, and to carry out your studies in both the classroom and in the field. Through studying zoology, ecology, genetics, conservation biology, spatial planning and policy from leading academics and industry partners, you'll gain the expertise and skills to seek employment opportunities in environmental consulting, wildlife conservation programs and fauna management. This extended major also prepares you for entry into Honours in Conservation Biology, honours in Zoology and the Master of Biological Science.",
        "Outcomes": [
            "Describe the major differences in the development, structure and functioning of animals and to explain animal diversity in a phylogenetic context;",
            "Summarise broad patterns of global biodiversity and the evolutionary history of australia's biodiversity;",
            "Explain how animals function in different environments using physiological, ecological and genetic concepts;",
            "Experience how to survey, sample and handle wild animals under field conditions;",
            "Identify timescales and their importance to processes of evolution, environmental change and the dynamics of australian ecosystems;",
            "Describe the crucial relationship between an animal's physiology, behavior and ecology and its vulnerability to rapid environmental change;",
            "Analyse the major threats to wild animal populations, and how threats interact with other threats;",
            "Critique how key threatening processes are managed and mitigated in australia;",
            "Explain the role of different stakeholders in shaping policy, planning and decision-making;",
            "Demonstrate high-level analytical, critical thinking and communication skills suited to gaining employment in wildlife conservation; and",
            "demonstrate competency in laboratory practice, report writing, oral presentation, fieldwork and team work skills suited to gain employment in wildlife conservation.."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "GEOG1104",
            "SCIE1104"
        ],
        "Level2Units": [
            "ANIM2207",
            "ANIM2209",
            "ANIM2220",
            "BIOL2261",
            "ENVT2221",
            "ENVT2250",
            "GEOG2201"
        ],
        "Level3Units": [
            "ANIM3353",
            "ANIM3361",
            "ANIM3363",
            "ANIM3365",
            "BIOL3360",
            "BIOL3364",
            "GEOG3303"
        ],
        "Level4Units": []
    },
    "MJD-ZOOLY": {
        "Name": "Zoology",
        "Description": "The Zoology major will provide you with the opportunity to study animals and their habitats including Western Australia's unique fauna. These habitats are diverse, and range from deserts through to temporary wetlands and rainforests. Zoologists discover the solutions to the problems presented by these habitats. This major will provide you with a sound knowledge and understanding of animal structure and function and the evolutionary processes that have engendered animal diversity. Zoologists also study physiology, reproduction, behaviour, community ecology and molecular genetics. Zoology underpins society's interest in conservation and marine science including major contributions to current research in fisheries and ecosystem management. It is envisaged that there will be up to two overnight field trips (cost of food and accommodation of up to \\$200 for around four nights to be borne by the student).",
        "Outcomes": [
            "Demonstrate basic knowledge of the development, structure and functioning of animals, ecological processes, and animal diversity in a phylogenetic context;",
            "Demonstrate awareness of the local importance of animals in a conservation context;",
            "Demonstrate awareness of the ethics of working with animals;",
            "Understand methods of working with animals under laboratory conditions;",
            "Demonstrate knowledge of sampling and handling animals under field conditions;",
            "Demonstrate knowledge of quantification of animal laboratory and field studies;",
            "Understand how research advances knowledge; and",
            "apply relevant employability skills for zoology."
        ],
        "Prerequisites": "Mathematics Methods ATAR or Mathematics Applications ATAR with a mathematics unit taken in the first year. Students without ATAR mathematics will take two first year mathematics units.",
        "Level1Units": [
            "BIOL1130",
            "BIOL1131",
            "SCIE1104",
            "SCOM1101"
        ],
        "Level2Units": [
            "ANIM2207",
            "ANIM2220"
        ],
        "Level3Units": [
            "ANIM3361",
            "ANIM3363",
            "ANIM3365",
            "BIOL3364"
        ],
        "Level4Units": []
    },
    "MJD-ANTHR": {
        "Name": "Anthropology",
        "Description": "Anthropology is the comparative study of human diversity, past and present. It examines behaviour, relationships and meaning within and between different societies and cultures. This major incorporates the study of key anthropological theories, and the history of the discipline, and introduces students to anthropological perspectives on: religion and ritual, politics, kinship and land rights, and ecology and environment. It does so in a way that elucidates local experiences, yet addresses the ‘big questions' for the future of human societies: not least that of climate change. The major provides students with a comprehensive overview of one of the social sciences' core research methods: ethnography. Throughout, an emphasis is placed upon active learning and assessment, which enable students to develop job-ready skills, for working in fields such as: heritage, community and social development, or policy and analysis – in Australia, or anywhere in the world.",
        "Outcomes": [
            "Demonstrate an understanding of key concepts in social and cultural anthropology. understand anthropological perspectives on: religion and ritual, politics, kinship and land rights, and ecology and environment.;",
            "Acquire knowledge of anthropology as an academic discipline in historical context, including principal concepts and theories, and key thinkers;",
            "Develop the skills necessary to critically review, analyse, summarize and synthesize anthropological research and theory;",
            "Learn how to formulate, investigate and discuss anthropologically informed research questions and develop arguments based on a critical evaluation of written evidence, and of material culture;",
            "Explore how to communicate anthropological ideas, principles and knowledge to specialist and non-specialist audiences using a range of multi-modal formats (written, oral, visual etc.); and",
            "understand and practice how to conduct ethical, self-aware, and efficient research, using ethnographic and associated methods, including object-based learning.."
        ],
        "Level1Units": [
            "ANTH1001",
            "GEOG1104"
        ],
        "Level2Units": [
            "ANTH2225",
            "ANTH2406",
            "ANTH2902"
        ],
        "Level3Units": [
            "ANTH3001",
            "ANTH3401",
            "ANTH3601"
        ],
        "Level4Units": []
    },
    "MJD-APHGY": {
        "Name": "Applied Human Geography",
        "Description": "Creating sustainable and vibrant communities and economies are key challenges facing society, particularly in the context of rising inequality and significant global environmental change. As a discipline, Human Geography - the study of how historical, economic, political, demographic, social and environmental processes intersect to shape life in different places – is uniquely positioned to address these major challenges. In this course, you will gain a comprehensive understanding of the complex, interwoven processes shaping human activity in cities and regions at a range of spatial scales from the global to the local. ",
        "Outcomes": [
            "Identify the complex interplay of economic, demographic, environmental, economic, social and political processes that influence the spatial organisation of human activities at a range of scales;",
            "Demonstrate an understanding of human geography as an academic discipline and an ability to deploy its core concepts, with intellectual rigour, in creatively addressing real-world analytical challenges and tasks;",
            "Critically evaluate data an policy approaches used to address intersecting economic, demographic, environmental and social challenges shaping the characteristics of cities and regions;",
            "Apply geographic methods and analytical tools to investigate and interpret urban and regional phenomena.;",
            "Demonstrate the ability to communicate  geographic knowledge to specialist and non-specialist audiences through multiple media.; and",
            "Adopt ethical, self-aware and efficient approaches to autonomous and collaborative work."
        ],
        "Level1Units": [
            "GEOG1104",
            "GEOG1107"
        ],
        "Level2Units": [
            "GEOG2201",
            "GEOG2202",
            "GEOG2203",
            "GEOG2206"
        ],
        "Level3Units": [
            "GEOG3303",
            "GEOG3308",
            "GEOG3311"
        ],
        "Level4Units": []
    },
    "MJD-ARCGY": {
        "Name": "Archaeology",
        "Description": "Archaeology is the only discipline to study all of human history in all of its facets. This major is designed to provide students with a general understanding of archaeology globally and and more specific understanding of Australian archaeology over the last 65,000 years. Topics include: human origins and symbolic behaviour, stone tools, rock art, archaeozoology, archaeobotany, forensics, scientific dating, Indigenous knowledge, historical and maritime archaeology. We also examine and put into practice how archaeology contributes to contemporary issues like heritage management, graffiti and homelessness. The analytical and practical elements of the discipline - in which valuable transferable and experiential work-integrated skills are learned - are taught within laboratory and field work units. Three annual field schools are held dealing with archaeology, rock art and forensic science respectively. UWA Archaeology's teaching is research-led by some of the leading scholars in the field. And, it's all a lot of fun!",
        "Outcomes": [
            "Critically analyse and apply competing theories of the interpretation of archaeological evidence;",
            "Critically evaluate archaeological principles and methods and apply them to archaeological questions;",
            "Demonstrate a critical and reflexive understanding of ethical issues relevant to archaeological practice;",
            "Demonstrate a critical judgement of archaeological practices and research traditions;",
            "Independently and critically undertake research through the collection and interpretation of archaeological information and report on this process both orally and through written expression; and",
            "demonstrate basic competency of core archaeological field, laboratory and analytical techniques."
        ],
        "Level1Units": [
            "ARCY1001",
            "ARCY1002"
        ],
        "Level2Units": [
            "ARCY2001",
            "ARCY2004",
            "ARCY2005",
            "ARCY2006",
            "FNSC2200"
        ],
        "Level3Units": [
            "ARCY3002",
            "ARCY3003"
        ],
        "Level4Units": []
    },
    "MJD-ASSTD": {
        "Name": "Asian Studies",
        "Description": "Asia is home to two-thirds of the world's population and some of the most dynamic and fascinating societies on the planet. It is also an economic powerhouse vital to Australia's future prosperity and security. But what do we really know about the region in which we live? Asian Studies introduces you to the many cultures, societies and politics of Asia including China, Indonesia and Japan. It explores the impact of the great religions such as Buddhism, Hinduism and Islam and investigates the dramatic changes that colonialism and revolutions have brought to the people of the region. Students develop critical knowledge of contemporary Asia and the social, cultural, political and economic forces which are shaping modern societies in the region. The Asian Studies major does not require you to learn an Asian language.",
        "Outcomes": [
            "Demonstrate critical knowledge of debates and discourses surrounding contemporary issues in asia;",
            "Demonstrate an understanding of the complexities of sociocultural, political, economic and environmental transformations and interactions in postcolonial asia;",
            "Demonstrate ethical sensitivity towards our diverse and globalised world;",
            "Express original arguments in both oral and written forms, and demonstrate an ability to engage with theoretical and academic literature;",
            "Conduct independent research; and",
            "demonstrate excellent cross-cultural understandings and become better communicators at all levels, in oral and written forms and in interpersonal communication."
        ],
        "Level1Units": [
            "ASIA1001",
            "ASIA1002"
        ],
        "Level2Units": [
            "ASIA2001",
            "ASIA2002",
            "ASIA2004"
        ],
        "Level3Units": [
            "ASIA3001",
            "ASIA3002",
            "ASIA3003",
            "ASIA3004",
            "ASIA3005",
            "ASIA3006"
        ],
        "Level4Units": []
    },
    "MJD-BSLAW": {
        "Name": "Business Law",
        "Description": "As the accountability and personal liability of professionals, business managers and public servants continues to grow, a strong grounding in business law is becoming an increasingly attractive attribute for potential employers both nationally and internationally. The Business Law major focuses on the fundamental relationship between law and business and is ideal for those planning careers in a wide range of business areas including professional accounting, business management, international trade and industrial relations. It equips you with high-level analytical, problem-solving, research and communication skills that will enable you to recognise, analyse and, where possible, avoid the legal problems that arise in the course of many common business transactions. In cases where such avoidance is not possible, Business Law students have the knowledge to intelligently request and act on legal services and advice.",
        "Outcomes": [
            "Demonstrate a comprehensive understanding of the main principles of business law with depth in each of the following areas:  what we know about the law, how it is made and how it works in our society;",
            "Demonstrate an understanding of legal reasoning, rules, institutions, players and power structures;",
            "Demonstrate an understanding of how law operates in the context of modern commercial practice to facilitate a range of business transactions, including financing transactions, provide appropriate  structures for the conduct of various business activities and resolve disputes between parties involved in any or all of these activities or structures;",
            "Demonstrate developed cognitive skills to review, analyse, consolidate and synthesise knowledge, identify and solve defined problems, and exercise critical judgement and thinking in creating new understanding;",
            "Demonstrate well developed skills to present data and evidence in an appropriate format and communicate through written and oral media clearly, effectively and appropriately in a range of contexts to a variety of audiences;",
            "Demonstrate well developed skills to work productively in a group;",
            "Demonstrate well developed bibliographic and referencing skills; and",
            "demonstrate basic time and project management skills."
        ],
        "Level1Units": [
            "ACCT1101",
            "LAWS1104"
        ],
        "Level2Units": [
            "LAWS2201",
            "LAWS2207",
            "LAWS2301"
        ],
        "Level3Units": [
            "LAWS3222",
            "LAWS3308"
        ],
        "Level4Units": []
    },
    "MJD-CHNSA": {
        "Name": "CHNSA Chinese Studies",
        "Description": "The Chinese Studies major provides students with high-quality learning opportunities and an outstanding student experience in learning Chinese language and culture. China is the largest trading partner for Australia, and the historical links between Australia and the Chinese-speaking world have been further enhanced in the 21st century thanks to frequent economic and cultural interactions between the two nations. Chinese Studies equips students with solid language skills and a broad in-depth knowledge of China, its society and people, placing students in a strong position to utilise the opportunities generated by China's long history, rich culture and rapid economic growth. Students will graduate with an in-depth understanding of the increasingly globalising world, as well as a versatile portfolio of skills and aptitudes which enhance employability.",
        "Outcomes": [
            "Demonstrate a good written and spoken linguistic competence in the chinese language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Identify key ethical, philosophical and social characteristics of chinese culture, society and history, and apply this knowledge in the context of future employment or postgraduate study;",
            "Engage effectively in the key debates on chinese history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable).."
        ],
        "Prerequisites": "This major is designed for near-native speakers. Admission to the major will be required to sit a placement test/ interview.",
        "Level1Units": [
            "CHIN1405",
            "CHIN1406"
        ],
        "Level2Units": [
            "CHIN2407",
            "CHIN2408"
        ],
        "Level3Units": [
            "ASIA3003",
            "CHIN3409",
            "CHIN3410"
        ],
        "Level4Units": []
    },
    "MJD-CHNSB": {
        "Name": "CHNSB Chinese Studies",
        "Description": "The Chinese Studies major provides students with high-quality learning opportunities and an outstanding student experience in learning Chinese language and culture. China is the largest trading partner for Australia, and the historical links between Australia and the Chinese-speaking world have been further enhanced in the 21st century thanks to frequent economic and cultural interactions between the two nations. Chinese Studies equips students with solid language skills and a broad in-depth knowledge of China, its society and people, placing students in a strong position to utilise the opportunities generated by China's long history, rich culture and rapid economic growth. Students will graduate with an in-depth understanding of the increasingly globalising world, as well as a versatile portfolio of skills and aptitudes which enhance employability.",
        "Outcomes": [
            "Demonstrate a good written and spoken linguistic competence in the chinese language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Identify key ethical, philosophical and social characteristics of chinese culture, society and history, and apply this knowledge in the context of future employment or postgraduate study;",
            "Engage effectively in the key debates on chinese history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable).."
        ],
        "Level1Units": [
            "CHIN1401",
            "CHIN1402"
        ],
        "Level2Units": [
            "CHIN2001",
            "CHIN2403",
            "CHIN2404"
        ],
        "Level3Units": [
            "ASIA3003",
            "CHIN3405",
            "CHIN3406"
        ],
        "Level4Units": []
    },
    "MJD-CHNSI": {
        "Name": "CHNSI Chinese Studies",
        "Description": "The Chinese Studies major provides students with high quality learning opportunities and an outstanding student experience in learning Chinese language and culture. China is the largest trading partner for Australia and the historical links between Australia and the Chinese-speaking world have been further enhanced in the twenty-first century thanks to frequent economic and cultural interactions between the two nations. Chinese Studies equips students with solid language skills and a broad in-depth knowledge of China, its society and people, placing students in a strong position to utilise the opportunities generated by China's long history, rich culture and rapid economic growth. Students graduate with an in-depth understanding of the increasingly globalising world, as well as a versatile portfolio of skills and aptitudes which enhance employability.",
        "Outcomes": [
            "Demonstrate a good written and spoken linguistic competence in the chinese language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Identify key ethical, philosophical and social characteristics of chinese culture, society and history, and apply this knowledge in the context of future employment or postgraduate study;",
            "Engage effectively in the key debates on chinese history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Level1Units": [
            "CHIN1403",
            "CHIN1404"
        ],
        "Level2Units": [
            "CHIN2405",
            "CHIN2406"
        ],
        "Level3Units": [
            "ASIA3003",
            "CHIN3407",
            "CHIN3408"
        ],
        "Level4Units": []
    },
    "MJD-CHNSP": {
        "Name": "CHNSP Chinese Studies",
        "Description": "The Chinese Studies major provides students with high-quality learning opportunities and an outstanding student experience in learning Chinese language and culture. China is the largest trading partner for Australia, and the historical links between Australia and the Chinese-speaking world have been further enhanced in the 21st century thanks to frequent economic and cultural interactions between the two nations. Chinese Studies equips students with solid language skills and a broad in-depth knowledge of China, its society and people, placing students in a strong position to utilise the opportunities generated by China's long history, rich culture and rapid economic growth. Students will graduate with an in-depth understanding of the increasingly globalising world, as well as a versatile portfolio of skills and aptitudes which enhance employability.",
        "Outcomes": [
            "Demonstrate a good written and spoken linguistic competence in the chinese language;",
            "Understand how culturally-specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Identify key ethical, philosophical and social characteristics of chinese culture, society and history, and apply this knowledge in the context of future employment or postgraduate study;",
            "Engage effectively in the key debates on chinese history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Prerequisites": "WACE Chinese:Second Language CSL 2A/2B",
        "Level1Units": [
            "CHIN1001",
            "CHIN1403"
        ],
        "Level2Units": [
            "CHIN2404",
            "CHIN2405",
            "CHIN2406"
        ],
        "Level3Units": [
            "ASIA3003",
            "CHIN3407",
            "CHIN3408"
        ],
        "Level4Units": []
    },
    "MJD-CLANH": {
        "Name": "Classics and Ancient History",
        "Description": "Classics and Ancient History is the study of the languages, literature, history, art and archaeology of the ancient Greek and Roman civilisations. These two cultures lie at the very foundation of the modern world, and we are surrounded by their legacy: from the Olympic Games to the alphabet, from democracy to Christianity, from theatre to the rule of law—wherever we turn we find ourselves in their debt. These uncannily familiar Greeks and the Romans struggled with many of the same crucial issues as we do: globalisation, the 'clash of civilisations' and the decline of great powers. This exciting major lets you combine the languages with the history and archaeology of the classical world to give you a holistic picture of this vibrant and eternally relevant era. UWA is the only university in Western Australia where you can study this intriguing major.",
        "Outcomes": [
            "Describe the chief eras, achievements and enduring legacies of the classical world;",
            "assess various forms (written and material) of evidence used to study the classical world, and synthesise such diverse evidence"
        ],
        "Level1Units": [
            "CLAN1002"
        ],
        "Level2Units": [
            "CLAN2001",
            "CLAN2002",
            "CLAN2102",
            "CLAN2103",
            "CLAN2201",
            "CLAN2202"
        ],
        "Level3Units": [
            "CLAN3002",
            "CLAN3004",
            "CLAN3006",
            "CLAN3008",
            "CLAN3009",
            "CLAN3010",
            "CLAN3011",
            "CLAN3012",
            "CLAN3104",
            "CLAN3203",
            "CLAN3204"
        ],
        "Level4Units": []
    },
    "MJD-CRIMN": {
        "Name": "Criminology",
        "Description": "Criminology is an inter-disciplinary subject area that has emerged from the attention distinct disciplines have paid to offenders and offending. As such, the Criminology major draws on knowledge and perspectives from a range of disciplines including Law, Psychology, History, Anthropology and Geography. The combination of core and optional units in this major structure will expose students to the breadth of issues being addressed by contemporary Criminology. Included in this will be understanding of the practical role Criminology plays in advising governments on issues relating to criminality, crime prevention, policing, corrective services, sentencing, and offender treatment. ",
        "Outcomes": [
            "Apply criminological theoretical frameworks to analyse contemporary challenges relating to crime, victimisation, crime prevention, and the criminal justice system;",
            "Generate evidence-based empirical and theoretical knowledge in the examination of historical and contemporary crime and justice issues, using the broad range of disciplines that underpin criminology;",
            "Recognise, interpret, and critique contemporary trends in crime;",
            "Develop and use appropriate cognitive and technical skills to engage with ongoing theoretical debates in criminology through critical analysis of information and data from relevant criminal justice sources; and",
            "develop and use appropriate communication skills to facilitate effective dissemination of evidence-based knowledge in a clear and articulate manner."
        ],
        "Level1Units": [
            "LAWS1110"
        ],
        "Level2Units": [
            "LAWS2223",
            "LAWS2230"
        ],
        "Level3Units": [
            "LAWS3374"
        ],
        "Level4Units": []
    },
    "MJD-CRMDM": {
        "Name": "Criminology and Criminal Justice",
        "Description": "Criminology is an inter-disciplinary subject area that has emerged from the attention distinct disciplines have paid to offenders and offending, and responding to both. As such, this extended Criminology and Criminal Justice major draws broadly on knowledge and perspectives from a range of disciplines including Law, Psychology, History, Anthropology, and Geography. The combination of core and optional units in this major structure will expose students to the breadth of contemporary Criminology and Criminal Justice issues. Included in this will be understanding the practical role Criminology plays in advising governments on issues relating to national, international, and transnational criminality, crime prevention, policing, sentencing, corrective services, offender treatment, and offender risk assessment and management. Additionally, this extended major also requires students to develop a relevant understanding of the importance of forensic science for justice and the relevance of empirical research to guide policy development, reform and practice. ",
        "Outcomes": [
            "Apply criminological theoretical frameworks to analyse contemporary challenges relating to crime, victimisation, crime prevention, and the criminal justice system;",
            "Generate evidence-based empirical and theoretical knowledge in the examination of national, international, and transnational contemporary crime and justice issues, using the broad range of disciplines that underpin criminology;",
            "Recognise, interpret, and critique contemporary trends in crime, punishment, and justice administration;",
            "Develop and use appropriate research and analytical skills to engage with ongoing theoretical debates in criminology and criminal justice; and",
            "develop and use appropriate communication skills to facilitate effective dissemination of evidence-based knowledge in a clear and articulate manner."
        ],
        "Prerequisites": "Enrollment in BP050 Bachelor of Criminology and Criminal Justice",
        "Level1Units": [
            "LAWS1110",
            "LAWS1111"
        ],
        "Level2Units": [
            "FNSC2200",
            "LAWS2223",
            "LAWS2230",
            "LAWS2231",
            "PSYC2203"
        ],
        "Level3Units": [
            "LAWS3212",
            "LAWS3213",
            "LAWS3374"
        ],
        "Level4Units": []
    },
    "MJD-ECNSM": {
        "Name": "Economics",
        "Description": "The rise and fall of economies, future employment prospects, incomes and living standards are all at the heart of economics. In a number of countries, elections are won or lost on the basis of economic issues such as taxation, debt or deficits. The Economics major prepares you for work in financial institutions, government, international agencies and the private sector as a forecaster, analyst or consultant. The major includes core subjects in both microeconomics and macroeconomics. Microeconomics provides the framework for analysing issues in taxation, trade and the competitive structure of markets, while macroeconomics focuses on the forces that influence long-term economic growth, inflation, unemployment and the balance of payments. Students also develop the capacity to understand the fundamental workings of the economy and markets, and implications of economic policy. The Economics major can be combined with a major in Finance if you are interested in pursuing a career as a financial economist.",
        "Outcomes": [
            "Demonstrate comprehensive theoretical and applied economic knowledge;",
            "Apply sound economic reasoning to analyse key economic information used to inform effective decision-making;",
            "Be effective and perceptive communicators of economic information to specialist and non-specialist audiences;",
            "Be effective team members and work effectively and collaboratively with others;",
            "Apply reflective and critical thinking skills to economic problems with responsibility and accountability.; and",
            "demonstate awareness of ethical, cultural, social and sustainability issues relevant to the discipline."
        ],
        "Level1Units": [
            "ECON1101",
            "ECON1102"
        ],
        "Level2Units": [
            "ECON2233",
            "ECON2234"
        ],
        "Level3Units": [
            "ECON3205",
            "ECON3210",
            "ECON3220",
            "ECON3235",
            "ECON3236",
            "ECON3301",
            "ECON3302",
            "ECON3303",
            "ECON3310",
            "ECON3350",
            "ECON3371",
            "ECON3395"
        ],
        "Level4Units": []
    },
    "MJD-EGCST": {
        "Name": "English and Literary Studies",
        "Description": "Studying English Literary Studies enriches students' understanding of major literary, cinematic and theatrical forms from English-speaking cultures across the globe by allowing students to explore many areas of reading, writing and performance. This major includes units in the literary history of Britain, America, Australia and postcolonial societies; creative writing and theatre; popular culture and film; and critical theory. The emphasis is on developing an understanding of how we communicate and of diverse forms of representation across time, culture and media.",
        "Outcomes": [
            "Interpret texts produced in varied cultural and historical contexts with sensitivity to the generic dimensions, intertextual significance, and formal qualities of those texts;",
            "Evaluate and make use of critical scholarship in the discipline of english literary studies;",
            "Clearly express ideas, examples and arguments in appropriate written and oral forms;",
            "Deploy skills of critical analysis and independent critical reasoning; and",
            "work effectively as a member of a collaborative group."
        ],
        "Level1Units": [
            "ENGL1000",
            "ENGL1002",
            "ENGL1401",
            "ENGL1501",
            "ENGL1902"
        ],
        "Level2Units": [
            "ENGL2200",
            "ENGL2210",
            "ENGL2215",
            "ENGL2401",
            "ENGL2501",
            "ENGL2604"
        ],
        "Level3Units": [
            "ENGL3001",
            "ENGL3200",
            "ENGL3300",
            "ENGL3602",
            "ENGL3604",
            "ENGL3801"
        ],
        "Level4Units": []
    },
    "MJD-FRNHA": {
        "Name": "FRNHA French Studies",
        "Description": "Studying French is not simply about learning a language—it's an experience that will open your mind to different cultures and enrich you with knowledge of history. French Studies helps you achieve high levels of competency in listening, speaking, writing and reading the French language. Learning the language also introduces you to the culture and intellectual accomplishments of French-speaking people in France itself and the many French-speaking communities around the world. We offer the French Studies major to students at all levels, from beginners through to native speakers. During the course you will also study past and present French literature, films, and popular culture, providing you with a holistic and stimulating cultural and educational experience.",
        "Outcomes": [
            "Show competence in the french language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving french cultural conventions;",
            "Interpret french language texts—written, audio, visual—in the light of french culture and society; and",
            "move with accuracy and skill between the English and French languages and cultures."
        ],
        "Level1Units": [
            "FREN1405",
            "FREN1406"
        ],
        "Level2Units": [
            "FREN2407",
            "FREN2408",
            "FREN2812"
        ],
        "Level3Units": [
            "FREN3409",
            "FREN3813",
            "FREN3814"
        ],
        "Level4Units": []
    },
    "MJD-FRNHB": {
        "Name": "FRNHB French Studies",
        "Description": "Studying French is not simply about learning a language—it's an experience that will open your mind to different cultures and enrich you with knowledge of history. French Studies helps you achieve high levels of competency in listening, speaking, writing and reading the French language. Learning the language also introduces you to the culture and intellectual accomplishments of French-speaking people in France itself and the many French-speaking communities around the world. We offer the French Studies major to students at all levels, from beginners through to native speakers. During the course you will also study past and present French literature, films, and popular culture, providing you with a holistic and stimulating cultural and educational experience.",
        "Outcomes": [
            "Show competence in the french language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving french cultural conventions;",
            "Interpret french language texts—written, audio, visual—in the light of french culture and society; and",
            "move with accuracy and skill between the English and French languages and cultures."
        ],
        "Prerequisites": "WACE French FRE 2A/2B or higher",
        "Level1Units": [
            "FREN1401",
            "FREN1402"
        ],
        "Level2Units": [
            "FREN2001",
            "FREN2403",
            "FREN2404"
        ],
        "Level3Units": [
            "FREN3405",
            "FREN3406"
        ],
        "Level4Units": []
    },
    "MJD-FRNHI": {
        "Name": "FRNHI French Studies",
        "Description": "Studying French is not simply about learning a language—it's an experience that will open your mind to different cultures and enrich you with knowledge of history. French Studies helps you achieve high levels of competency in listening, speaking, writing and reading the French language. Learning the language also introduces you to the culture and intellectual accomplishments of French-speaking people in France itself and the many French-speaking communities around the world. We offer the French Studies major to students at all levels, from beginners through to native speakers. During the course you will also study past and present French literature, films, and popular culture, providing you with a holistic and stimulating cultural and educational experience.",
        "Outcomes": [
            "Show competence in the french language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving french cultural conventions;",
            "Interpret french language texts—written, audio, visual—in the light of french culture and society; and",
            "move with accuracy and skill between the English and French languages and cultures."
        ],
        "Level1Units": [
            "FREN1403",
            "FREN1404"
        ],
        "Level2Units": [
            "FREN2405",
            "FREN2406",
            "FREN2812"
        ],
        "Level3Units": [
            "FREN3407",
            "FREN3408"
        ],
        "Level4Units": []
    },
    "MJD-GNWST": {
        "Name": "Gender Studies",
        "Description": "The Gender Studies major traces histories, theories, and experiences of gender and its intersections with race, class and sexuality. It explores the everyday practices, institutions, and cultural texts of students' gendered lives and investigates the social and cultural legacies that inform contemporary lived experience. The major is grounded in interdisciplinary methodologies and equips students with the analytical, communication, and advocacy skills to foster equity, diversity and inclusion in any context.  Gender Studies also emphasizes skills in collaboration, teamwork, leadership, group dynamics, and literacy in screen, print and digital cultures.",
        "Outcomes": [
            "Demonstrate a comprehensive knowledge of feminist thought, its key shifts, major theorists and philosophical movements including queer theory and masculinity studies as emergent branches;",
            "Articulate the complexities of gender as a socially constructed practice that is situated in time and place, and intersects with other subject positions like race, class, religion, and sexuality;",
            "Contextualise the history of women's liberation as a social movement, its links to feminist activism and other social justice movements, and the continuing relevance of linking theory to practice;",
            "Use feminist methods of research, writing, and thinking about gender including reflexively creating, situating, and queering knowledge;",
            "Communicate effective arguments using concepts such as gender, sexuality, ideology, subjectivity, corporeality,  agency, and intersectionality; and",
            "deploy communicative strategies that model and facilitate respect for others, social inclusion, and constructive dialogue."
        ],
        "Level1Units": [
            "ENGL1902",
            "GEND1901"
        ],
        "Level2Units": [
            "GEND2902",
            "GEND2903"
        ],
        "Level3Units": [
            "GEND3901"
        ],
        "Level4Units": []
    },
    "MJD-GRMNA": {
        "Name": "GRMNA German Studies",
        "Description": "German Studies is the study of the German language and its various cultures. It teaches students high levels of competency in the German language through speaking, writing, listening and reading. This major offers a wide perspective on German society as it considers the culture and history of German-speaking people, not only in Germany, Austria and Switzerland but across the globe. Social history and culture are studied from the many centuries of German literary tradition—prose, poetry and drama, music, film and advertising. We offer this major at all levels, from beginners through to native speakers.",
        "Outcomes": [
            "Show competence in the german language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving german cultural conventions;",
            "Interpret german language texts—written, audio, visual—in the light of german culture and society; and",
            "move with accuracy and skill between the English and German languages and cultures."
        ],
        "Level1Units": [
            "GRMN1405",
            "GRMN1406"
        ],
        "Level2Units": [
            "GRMN2812"
        ],
        "Level3Units": [
            "GRMN3813"
        ],
        "Level4Units": []
    },
    "MJD-GRMNB": {
        "Name": "GRMNB German Studies",
        "Description": "German Studies is the study of the German language and its various cultures. It teaches students high levels of competency in the German language through speaking, writing, listening and reading. This major offers a wide perspective on German society as it considers the culture and history of German-speaking people, not only in Germany, Austria and Switzerland but across the globe. Social history and culture are studied from the many centuries of German literary tradition—prose, poetry and drama, music, film and advertising. We offer this major at all levels, from beginners through to native speakers.",
        "Outcomes": [
            "Show competence in the german language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving german cultural conventions;",
            "Interpret german language texts—written, audio, visual—in the light of german culture and society; and",
            "move with accuracy and skill between the English and German languages and cultures."
        ],
        "Level1Units": [
            "GRMN1401",
            "GRMN1402"
        ],
        "Level2Units": [
            "GRMN2002",
            "GRMN2403",
            "GRMN2404"
        ],
        "Level3Units": [
            "GRMN3405",
            "GRMN3406",
            "GRMN3813"
        ],
        "Level4Units": []
    },
    "MJD-GRMNI": {
        "Name": "GRMNI German Studies",
        "Description": "German Studies is the study of the German language and its various cultures. It teaches students high levels of competency in the German language through speaking, writing, listening and reading. This major offers a wide perspective on German society as it considers the culture and history of German-speaking people, not only in Germany, Austria and Switzerland but across the globe. Social history and culture are studied from the many centuries of German literary tradition—prose, poetry and drama, music, film and advertising. We offer this major at all levels, from beginners through to native speakers.",
        "Outcomes": [
            "Show competence in the german language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving german cultural conventions;",
            "Interpret german language texts—written, audio, visual—in the light of german culture and society; and",
            "move with accuracy and skill between the English and German languages and cultures."
        ],
        "Prerequisites": "WACE German: GER3A/3B",
        "Level1Units": [
            "GRMN1403",
            "GRMN1404"
        ],
        "Level2Units": [
            "GRMN2405",
            "GRMN2406",
            "GRMN2812"
        ],
        "Level3Units": [
            "GRMN3813"
        ],
        "Level4Units": []
    },
    "MJD-HISTY": {
        "Name": "History",
        "Description": "Its scope spans millennia, its object of study is humanity, its sources are everywhere and everything. ",
        "Outcomes": [
            "Demonstrate a capacity to understand imaginatively other times, societies and cultures;",
            "Demonstrate an awareness of the world we live in, through reference to important aspects of humanity's past experience;",
            "Demonstrate a knowledge of major historical developments in a range of times and places;",
            "Identify main issues in a body of complex historical material;",
            "Critically evaluate differences and issues in others' interpretations of historical events;",
            "Describe and interpret evidence of past human experience, proposing explanations for the content of such evidence with reference to concepts such as power, myth, representation, culture and social structure;",
            "Independently formulate a logical argument, supported by relevant evidence;",
            "Express ideas in clear, cogent and correct english;",
            "Conduct independent research by locating and organising information relating to a specific question or problem;",
            "Utilise historical resources for research exercises and apply critical and analytical tools to them; and",
            "demonstrate a knowledge of the causes of historical change in a range of times and places."
        ],
        "Level1Units": [
            "HIST1001",
            "HIST1003",
            "HIST1103",
            "HIST1901"
        ],
        "Level2Units": [
            "GEND2902",
            "HIST2005",
            "HIST2006",
            "HIST2007",
            "HIST2008",
            "HIST2011",
            "HIST2013",
            "HIST2014",
            "HIST2015",
            "HIST2016",
            "HIST2017",
            "HIST2021",
            "HIST2202",
            "HIST2224",
            "HIST2345",
            "HIST2917"
        ],
        "Level3Units": [
            "HIST3001"
        ],
        "Level4Units": []
    },
    "MJD-HYART": {
        "Name": "History of Art",
        "Description": "Art is not a singular entity, but changes in time and space as cultures, that produce it, change. The History of Art major introduces you to art within the whole spectrum of our visual experience. It encompasses studies in visual arts, literature, film and new media, architecture, landscape architecture and the impact of other art and design practice on the history of cultures. Learning to experience aesthetic pleasure through emotional intuition and intellectual learning is an essential means of exploring the serious issues of past and present cultures from many parts of the world including Europe, America, Asia and Australia.",
        "Outcomes": [
            "Analyse  a range of images, texts and items of visual culture and their social, political, economic, religious or aesthetic contexts;",
            "Apply the key concepts, theories and methodologies of the discipline of art history in the study of art;",
            "Show a good general knowledge of several periods in the history of art as well as more detailed knowledge of particular subject areas studied in the major;",
            "Communicate by reasoned argument in written texts and general discussion the ideas and approaches of the discipline;",
            "Undertake independent research in the discipline of art history;",
            "Demonstrate understanding of the significance of the visual arts and complex images in the construction of identities, ideologies, social formations and our place in the world; and",
            "demonstrate understanding of the key contemporary issues of the discipline and their relevance to the study of art of diverse periods and cultures."
        ],
        "Level1Units": [
            "HART1000",
            "HART1003"
        ],
        "Level2Units": [
            "HART2001",
            "HART2041",
            "HART2043",
            "HART2044",
            "HART2201",
            "HART2202",
            "HART2203",
            "HART2207",
            "HART2222",
            "HART2223",
            "HART2234",
            "HART2237",
            "HART2243",
            "HART2274",
            "HART2275",
            "HART2370"
        ],
        "Level3Units": [
            "HART3001",
            "HART3040",
            "HART3044",
            "HART3203",
            "HART3276",
            "HART3301",
            "HART3302",
            "HART3310",
            "HART3330",
            "HART3331",
            "HART3333",
            "HART3340",
            "HART3361",
            "HART3371",
            "HART3375",
            "HART3666"
        ],
        "Level4Units": []
    },
    "MJD-HMRDM": {
        "Name": "Human Rights",
        "Description": "Human rights have come to be the dominant language in which contentious social and political questions are debated. Activists appeal to human rights in attempting to advance the interests of the oppressed. States appeal to human rights in justifying policy interventions, on both domestic and international scales. A complex set of legal and political institutions has evolved, centred around the idea of human rights. And a flourishing field of academic inquiry is now devoted to understanding, and debating, human rights issues.",
        "Outcomes": [
            "Evaluate competing positions and perspectives on human rights issues;",
            "Reason clearly and persuasively about contentious moral and political issues;",
            "Demonstrate a sophisticated understanding of the history of the human rights tradition as well as key contemporary controversies;",
            "Apply sophisitcated analytical and critical thinking skills to a diverse range of human rights issues; and",
            "demonstrate strong written and oral communication skills."
        ],
        "Level1Units": [
            "HIST1104",
            "HUMR1001",
            "INDG1150",
            "LAWS1111",
            "POLS1102"
        ],
        "Level2Units": [
            "HUMR2001",
            "IREL2001",
            "LAWS2224",
            "PPHE2211"
        ],
        "Level3Units": [
            "GEND3901",
            "HUMR3001",
            "IREL3002",
            "PHIL3003",
            "PPHE3327"
        ],
        "Level4Units": []
    },
    "MJD-INKHH": {
        "Name": "Indigenous Knowledge, History and Heritage",
        "Description": "The Indigenous Knowledge, History and Heritage major comprises an interdisciplinary course that will provide you with an opportunity to learn about the history, culture and philosophy of Aboriginal peoples in Australia. The units offered enable you to critically engage with the issues covered, across a number of disciplines, and connect to contemporary Australian social issues. Studying a major in Indigenous Knowledge, History and Heritage will give you a strong grounding in Aboriginal knowledge systems as well as Western disciplinary constructs around Indigenous knowledge and peoples. Graduates gain a broad understanding and knowledge of Aboriginal people, and their ability to work appropriately and effectively with Indigenous peoples is enhanced. They increase their ability to work in culturally competent ways and develop flexible, generic and portable skills essential to a changing global environment.",
        "Outcomes": [
            "Demonstrate a knowledge of the experience, history and culture of aboriginal peoples with a particular focus on western australia;",
            "Demonstrate an understanding of indigenous systems of knowledge and the relevance of these systems across a broad range of disciplines;",
            "Critically evaluate representations of aboriginal peoples in historical and academic discourse;",
            "Demonstrate a knowledge of ethical paradigms in aboriginal research and conduct independent research;",
            "Demonstrate an awareness of the major historical and cultural issues that inform present day aboriginal disadvantage; and",
            "clearly express ideas in discussion and writing."
        ],
        "Level1Units": [
            "INDG1150",
            "INDG1160"
        ],
        "Level2Units": [
            "INDG2300"
        ],
        "Level3Units": [
            "INDG3300"
        ],
        "Level4Units": []
    },
    "MJD-INDNB": {
        "Name": "INDNB Indonesian Studies",
        "Description": "The Indonesian Studies major enables students to achieve a high level of fluency in the language of Australia's closest neighbour and the world's fourth largest country. Indonesian is a relatively easy language to learn as it uses the Roman script and is simple to spell and pronounce. As well as learning how to speak, read and write Indonesian, students study Indonesia's vibrant culture, ethnically diverse society and never dull politics. There are also short and semester-long opportunities for students to spend time studying at an Indonesian university, a life-changing experience. Students graduate with a portfolio of skills and attributes that are much in demand by employers in both the public and private sectors. ",
        "Outcomes": [
            "Demonstrate a good written and spoken competence in the indonesian language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on indonesian history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Level1Units": [
            "INDO1401",
            "INDO1402"
        ],
        "Level2Units": [
            "INDO2001",
            "INDO2403",
            "INDO2404"
        ],
        "Level3Units": [
            "ASIA3001",
            "INDO3405",
            "INDO3406"
        ],
        "Level4Units": []
    },
    "MJD-INDNI": {
        "Name": "INDNI Indonesian Studies",
        "Description": "The Indonesian Studies major enables students to achieve a high level of fluency in the language of Australia's closest neighbour and the world's fourth largest country. Indonesian is a relatively easy language to learn as it uses the Roman script and is simple to spell and pronounce. As well as learning how to speak, read and write Indonesian, students study Indonesia's vibrant culture, ethnically diverse society and never dull politics. There are also short and semester-long opportunities for students to spend time studying at an Indonesian university, a life-changing experience. Students graduate with a portfolio of skills and attributes that are much in demand by employers in both the public and private sectors. ",
        "Outcomes": [
            "Demonstrate a good written and spoken competence in the indonesian language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on indonesian history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Level1Units": [
            "INDO1403",
            "INDO1404"
        ],
        "Level2Units": [
            "INDO2405",
            "INDO2406"
        ],
        "Level3Units": [
            "ASIA3001",
            "INDO3407",
            "INDO3408"
        ],
        "Level4Units": []
    },
    "MJD-INDNP": {
        "Name": "INDNP Indonesian Studies",
        "Description": "The Indonesian Studies major enables students to achieve a high level of fluency in the language of Australia's closest neighbour and the world's fourth largest country. Indonesian is a relatively easy language to learn as it uses the Roman script and is simple to spell and pronounce. As well as learning how to speak, read and write Indonesian, students study Indonesia's vibrant culture, ethnically diverse society and never dull politics. There are also short and semester-long opportunities for students to spend time studying at an Indonesian university, a life-changing experience. Students graduate with a portfolio of skills and attributes that are much in demand by employers in both the public and private sectors. ",
        "Outcomes": [
            "Demonstrate a good written and spoken competence in the indonesian language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on indonesian history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Level1Units": [
            "INDO1001",
            "INDO1403"
        ],
        "Level2Units": [
            "INDO2404",
            "INDO2405",
            "INDO2406"
        ],
        "Level3Units": [
            "ASIA3001",
            "INDO3407",
            "INDO3408"
        ],
        "Level4Units": []
    },
    "MJD-ITLNA": {
        "Name": "ITLNA Italian Studies",
        "Description": "Italian Studies involves the study of the Italian language as well as its culture. As a language, Italian is rewarding to study—opening up the riches of Italy's cultural past and the fascination of its dynamic present. It is the most widely spoken language in Australia after English because of the ongoing migrant, intellectual, cultural and commercial links between Australia and Italy. The Italian Studies major teaches you high levels of competency in speaking, writing, listening and reading. It also offers a wide perspective on Italian culture, considering not only the culture and history of Italy itself but also Italian-speaking communities around the world including Australia. We offer this major at all levels to challenge and engage you throughout your studies—from beginners through to native speakers. You will also be encouraged to enhance your educational experience by participating in exchange programs in Italy at approved universities such as Siena, Milan or Perugia.",
        "Outcomes": [
            "Show competence in the italian language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving italian cultural conventions;",
            "Interpret italian language texts—written, audio, visual—in the light of italian culture and society; and",
            "move with accuracy and skill between the English and Italian languages and cultures."
        ],
        "Level1Units": [
            "ITAL1405",
            "ITAL1406"
        ],
        "Level2Units": [
            "ITAL2407",
            "ITAL2408",
            "ITAL2812"
        ],
        "Level3Units": [
            "ITAL3409",
            "ITAL3410"
        ],
        "Level4Units": []
    },
    "MJD-ITLNB": {
        "Name": "ITLNB Italian Studies",
        "Description": "Italian Studies involves the study of the Italian language as well as its culture. As a language, Italian is rewarding to study—opening up the riches of Italy's cultural past and the fascination of its dynamic present. It is the most widely spoken language in Australia after English because of the ongoing migrant, intellectual, cultural and commercial links between Australia and Italy. The Italian Studies major teaches you high levels of competency in speaking, writing, listening and reading. It also offers a wide perspective on Italian culture, considering not only the culture and history of Italy itself but also Italian-speaking communities around the world including Australia. We offer this major at all levels to challenge and engage you throughout your studies—from beginners through to native speakers. You will also be encouraged to enhance your educational experience by participating in exchange programs in Italy at approved universities such as Siena, Milan or Perugia.",
        "Outcomes": [
            "Show competence in the italian language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving italian cultural conventions;",
            "Interpret italian language texts—written, audio, visual—in the light of italian culture and society; and",
            "move with accuracy and skill between the English and Italian languages and cultures."
        ],
        "Level1Units": [
            "ITAL1401",
            "ITAL1402"
        ],
        "Level2Units": [
            "ITAL2403",
            "ITAL2404",
            "ITAL2811"
        ],
        "Level3Units": [
            "ITAL3405",
            "ITAL3406"
        ],
        "Level4Units": []
    },
    "MJD-ITLNI": {
        "Name": "ITLNI Italian Studies",
        "Description": "Italian Studies involves the study of the Italian language as well as its culture. As a language, Italian is rewarding to study—opening up the riches of Italy's cultural past and the fascination of its dynamic present. It is the most widely spoken language in Australia after English because of the ongoing migrant, intellectual, cultural and commercial links between Australia and Italy. The Italian Studies major teaches you high levels of competency in speaking, writing, listening and reading. It also offers a wide perspective on Italian culture, considering not only the culture and history of Italy itself but also Italian-speaking communities around the world including Australia. We offer this major at all levels to challenge and engage you throughout your studies—from beginners through to native speakers. You will also be encouraged to enhance your educational experience by participating in exchange programs in Italy at approved universities such as Siena, Milan or Perugia.",
        "Outcomes": [
            "Show competence in the italian language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages;",
            "Interact confidently and successfully in situations involving italian cultural conventions;",
            "Interpret italian language texts—written, audio, visual—in the light of italian culture and society; and",
            "move with accuracy and skill between the English and Italian languages and cultures."
        ],
        "Prerequisites": "Admission to this major requires a pass in WACE Italian: ITA2A/2B or higher.",
        "Level1Units": [
            "ITAL1403",
            "ITAL1404"
        ],
        "Level2Units": [
            "ITAL2405",
            "ITAL2406",
            "ITAL2812"
        ],
        "Level3Units": [
            "ITAL3407",
            "ITAL3408"
        ],
        "Level4Units": []
    },
    "MJD-JPNSB": {
        "Name": "JPNSB Japanese Studies",
        "Description": "Studying Japanese language, culture and society means taking a significant step towards becoming Asia-literate—an important attribute for future global citizens, particularly in Australia. The Japanese Studies major caters for beginners and for students who have studied Japanese to high school level or equivalent. As well as learning how to speak, read and write Japanese, students examine Japanese history, society and popular culture. Knowledge of the Japanese language offers students access to a major world economic player with strong trade links with Western Australia.",
        "Outcomes": [
            "Show competence in the japanese language in the four skills of language acquisition—reading, writing, listening and speaking;",
            "Operate effectively in daily conversations or complex discussions in social and academic work situations;",
            "Understand and engage with japanese-language texts and japan-relevant english language material—written, audio or visual—of an intellectual nature in particular areas of interest and expertise;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on japanese history, society and culture in a professional manner and produce coherent and well-argued written work; and",
            "demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance."
        ],
        "Level1Units": [
            "JAPN1401",
            "JAPN1402"
        ],
        "Level2Units": [
            "JAPN2001",
            "JAPN2403",
            "JAPN2404"
        ],
        "Level3Units": [
            "ASIA3002",
            "JAPN3405",
            "JAPN3406"
        ],
        "Level4Units": []
    },
    "MJD-JPNSI": {
        "Name": "JPNSI Japanese Studies",
        "Description": "Studying Japanese language, culture and society means taking a significant step towards becoming Asia-literate—an important attribute for future global citizens, particularly in Australia. The Japanese Studies major caters for beginners and for students who have studied Japanese to high school level or equivalent. As well as learning how to speak, read and write Japanese, students examine Japanese history, society and popular culture. Knowledge of the Japanese language offers students access to a major world economic player with strong trade links with Western Australia.",
        "Outcomes": [
            "Show competence in the japanese language in the four skills of language acquisition—reading, writing, listening and speaking;",
            "Operate effectively in daily conversations or complex discussions in social and academic work situations;",
            "Understand and engage withjapanese-language texts and japan-relevant english language material—written, audio or visual—of an intellectual nature in particular areas of interest and expertise;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on japanese history, society and culture in a professional manner and produce coherent and well-argued written work; and",
            "demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance."
        ],
        "Prerequisites": "Admission to this major requires a pass in WACE Japanese: Second Language JSL3A/3B.",
        "Level1Units": [
            "JAPN1403",
            "JAPN1404"
        ],
        "Level2Units": [
            "JAPN2405",
            "JAPN2406"
        ],
        "Level3Units": [
            "ASIA3002",
            "JAPN3407",
            "JAPN3408"
        ],
        "Level4Units": []
    },
    "MJD-JPNSP": {
        "Name": "JPNSP Japanese Studies",
        "Description": "Studying Japanese language, culture and society means taking a significant step towards becoming Asia-literate—an important attribute for future global citizens, particularly in Australia. The Japanese Studies major caters for beginners and for students who have studied Japanese to high school level or equivalent. As well as learning how to speak, read and write Japanese, students examine Japanese history, society and popular culture. Knowledge of the Japanese language offers students access to a major world economic player with strong trade links with Western Australia.",
        "Outcomes": [
            "Show competence in the japanese language in the four skills of language acquisition—reading, writing, listening and speaking;",
            "Operate effectively in daily conversations or complex discussions in social and academic work situations;",
            "Understand and engage withjapanese-language texts and japan-relevant english language material—written, audio or visual—of an intellectual nature in particular areas of interest and expertise;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Engage effectively in the key debates on japanese history, society and culture in a professional manner and produce coherent and well-argued written work; and",
            "demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance."
        ],
        "Prerequisites": "WACE Japanese: Second Language JSL2A/2B",
        "Level1Units": [
            "JAPN1001",
            "JAPN1403"
        ],
        "Level2Units": [
            "JAPN2404",
            "JAPN2405",
            "JAPN2406"
        ],
        "Level3Units": [
            "ASIA3002",
            "JAPN3407",
            "JAPN3408"
        ],
        "Level4Units": []
    },
    "MJD-KOREB": {
        "Name": "Korean Studies",
        "Description": "The Korean Studies major provides students with high-quality learning opportunities and an outstanding student experience in learning Korean. With the rapid economic development of the Republic of Korea (South Korea), and its position as the third biggest trading partner for Western Australia, Korean Studies is an increasingly important area of study. Korean Studies equips students with solid language skills and a broad in-depth knowledge of Korea, its society and people. Students will graduate with an in-depth understanding of the increasingly globalising world, as well as a versatile portfolio of skills and aptitudes which enhance employability.",
        "Outcomes": [
            "Demonstrate a good written and spoken linguistic competence in the korean language;",
            "Understand how culturally specific social structures affect interpersonal communication, and determine how to apply this knowledge to their own interactions in a culturally sensitive manner;",
            "Identify key ethical, philosophical and social characteristics of korean culture, society and history, and apply this knowledge in the context of future employment or postgraduate study;",
            "Engage effectively in the key debates on korean history, society and culture in a professional manner and produce coherent and well-argued written work;",
            "Demonstrate competence in a set of transferable skills, including (but not limited to) digital literacy, information management, group working, research skills and critical thinking, as well as an ability to manage and take responsibility for their own learning processes with minimum guidance; and",
            "apply their country-specific knowledge in the context of their second major (if applicable)."
        ],
        "Level1Units": [
            "KORE1401",
            "KORE1402"
        ],
        "Level2Units": [
            "KORE2403",
            "KORE2404",
            "KORE2811"
        ],
        "Level3Units": [
            "ASIA3006",
            "KORE3405",
            "KORE3406"
        ],
        "Level4Units": []
    },
    "MJD-LWSOC": {
        "Name": "Law and Society",
        "Description": "What impact does law have on our lives? To what extent does law either control what we do or allow us to achieve what we want? Is the law the same thing as justice? Can the world be saved by law? This major examines broad theoretical issues about the nature of law and society as well as how the relationship plays out in particular fields of legal and social policy at both domestic and international levels. The fields you may study include human rights, decisions about birth and death, crime and justice, Indigenous rights, freedom of expression and religion. Studying Law and Society will help you develop important skills in research, analysis, teamwork and communication.",
        "Outcomes": [
            "Demonstrate comprehensive understanding with depth in what we know about the law, how it is made and how it works in our society;",
            "Demonstrate understanding of the underlying dynamics of the interdisciplinary field of law and society and its relationship to criminology including an in-depth understanding of legal reasoning, rules, institutions, players and power structures;",
            "Demonstrate understanding of the relationship between local, national and international legal systems, rules, practices and institutions;",
            "Demonstrate understanding of how law operates within social, cultural, political and historical contexts;",
            "Demonstrate well-developed cognitive skills to review, analyse, consolidate and synthesise knowledge, identify and solve defined problems, and exercise critical judgement and thinking in creating new understanding;",
            "Demonstrate well-developed bibliographic and referencing skills;",
            "Demonstrate basic time and project management skills;",
            "Demonstrate well-developed skills to present data and evidence in an appropriate format and communicate through written and oral media clearly, effectively and appropriately in a range of contexts for a variety of audiences;",
            "Demonstrate well-developed skills to work productively in a group;",
            "Use judgement and initiative by developing (a) ethical approaches and mature judgement in practical and academic matters; and (b) the capacity for effective citizenship, leadership and teamwork; and",
            "take responsibility and accountability for their own learning having developed attitudes which (a) value learning; and (b) respect Indigenous knowledge, values and culture."
        ],
        "Level1Units": [
            "LAWS1110",
            "LAWS1111"
        ],
        "Level2Units": [
            "LAWS2227"
        ],
        "Level3Units": [
            "LAWS3316"
        ],
        "Level4Units": []
    },
    "MJD-LINGO": {
        "Name": "Linguistics",
        "Description": "Linguistics is the study of human language and is concerned with what all languages have in common as well as how individual languages differ from one another. In practice, linguists study how languages are structured, how they are learned and used, and how languages change through time. This major includes both fascinating theoretical research and practical field-orientated projects. You will have the opportunity to work on a variety of linguistic topics including grammatical descriptions and dictionaries of Australian Aboriginal languages, analysis of Australian English, Romance languages, the study of meaning in language and the relation between language and society. You do not need to know a second language or be 'good at languages' to excel in Linguistics. Many excellent linguists speak only one language—all you need is a healthy curiosity.",
        "Outcomes": [
            "Describe important issues in defining language, particularly in distinguishing between language and communication, and between language system and language use;",
            "Describe key focuses of, and key concepts in, core sub-areas of linguistics—phonetics, phonology, morphology, syntax, discourse analysis, semantics, pragmatics, sociolinguistics, and historical linguistics;",
            "Describe key features of currently contending significant theoretical approaches to language structure;",
            "Describe key features of major approaches to language use and variation in social and historical contexts;",
            "Present critical evaluation of the arguments used in a linguistic analysis formulated within a theoretical model;",
            "Using established criteria, evaluate alternative analyses of given language data;",
            "Describe, using appropriate terminology and notation, basic structural patterns in data from a language, in the domains of phonology, grammar and lexicon;",
            "Demonstrate meta-linguistic knowledge of the basic structures and patterns of use of their own language;",
            "Propose analyses of structural patterns in language data within different theoretical models;",
            "Explain knowledge of the diversity of structures across languages; and",
            "find, critically interpret and synthesise the content of scholarly publications in Linguistics relevant to a particular topic."
        ],
        "Level1Units": [
            "LING1001",
            "LING1002"
        ],
        "Level2Units": [
            "LING2001",
            "LING2002",
            "LING2008"
        ],
        "Level3Units": [
            "LING3003",
            "LING3005",
            "LING3006",
            "LING3007",
            "LING3008",
            "WILG3001"
        ],
        "Level4Units": []
    },
    "MJD-PHILY": {
        "Name": "Philosophy",
        "Description": "The study of Philosophy involves thinking about some of the big questions we ask during our lifetime: Does God exist? Do the sciences tell us the truth about the world? How can we say what we mean? Are other people's experiences like our own? What does it mean to be conscious? What are emotions and how are they relevant to our lives? Philosophy teaches you to distinguish between good and bad arguments and make informed recommendations on contentious issues. Studying Philosophy allows you to explore a vast range of influential ideas, from the ancient philosophers, whose works are preserved in manuscripts from India, China and Greece, right down to cutting-edge contemporary work on pressing ethical issues, the nature of mind and artificial intelligence. UWA is the only university in Western Australia that teaches units in formal logic.",
        "Outcomes": [
            "Analyse and evaluate arguments;",
            "Distinguish between good arguments and bad arguments, irrespective of their subject matter, and thus make informed decisions and recommendations on contentious issues;",
            "Demonstrate clarity of thought;",
            "Separate distinct issues, consider them independently and think out the consequences of positions on them;",
            "Demonstrate the general skills for thinking about problems and tasks, and framing and evaluating solutions;",
            "Frame, express and convey ideas, their own and other people's, in a clear and convincing way; and",
            "appreciate the value of different perspectives on life, society and knowledge."
        ],
        "Level1Units": [
            "PHIL1001",
            "PHIL1002",
            "PHIL1003"
        ],
        "Level2Units": [
            "HUMR2001",
            "PHIL2001",
            "PHIL2002",
            "PHIL2003",
            "PHIL2004",
            "PHIL2005",
            "PHIL2006",
            "PHIL2007",
            "PHIL2008",
            "PPHE2001",
            "PPHE2211"
        ],
        "Level3Units": [
            "PHIL3001",
            "PHIL3002",
            "PHIL3003",
            "PHIL3004",
            "PHIL3005",
            "PHIL3006",
            "PHIL3007",
            "PHIL3008",
            "PPHE3327"
        ],
        "Level4Units": []
    },
    "MJD-PPEDM": {
        "Name": "Philosophy, Politics and Economics",
        "Description": "Very many important issues – climate change, healthcare, political participation, taxation and much more besides – have philosophical, political, and economic dimensions. UWA's Philosophy, Politics and Economics extended major is a challenging and rigorous programme which equips students to engage with such issues from an interdisciplinary perspective. Students receive a thorough grounding in each of the three disciplines, and will examine the ways in which insights from each area of study can fruitfully inform scholarship in the others. Students will also study the intertwined history of philosophy, politics, and economics, and develop invaluable critical thinking and analytical skills essential for success in the modern workplace.\r\n\r\nThis page is for students in the Bachelor of Philosophy, Politics, and Economics. Students who commenced the Bachelor of Arts prior to 2021 should refer to the Handbook for the original Philosophy, Politics and Economics Major.",
        "Outcomes": [
            "Explain the foundations of philosophy, political science, and economics;",
            "Demonstrate an understanding of the intertwined history of philosophy, political science, and economics;",
            "Apply insights from philosophy, politics, and economics to important social questions such as climate change, inequality, and distributive justice;",
            "Critically review assumptions underpinning philosophical, political and/or economic viewpoints on important social questions such as climate change, inequality, and distributive justice;",
            "Demonstrate sound research skills and written and oral communication skills; and",
            "demonstrate valuable analytical and critical thinking skills."
        ],
        "Level1Units": [
            "ECON1101",
            "ECON1102",
            "PHIL1002",
            "POLS1101"
        ],
        "Level2Units": [
            "ECON2105",
            "ECON2233",
            "PHIL2001",
            "PPHE2001",
            "PPHE2211"
        ],
        "Level3Units": [
            "PHIL3003",
            "PPHE3001",
            "PPHE3327"
        ],
        "Level4Units": []
    },
    "MJD-POLSC": {
        "Name": "Political Science and International Relations",
        "Description": "Societies can only continue to exist if they solve the problem of internal order and are able to protect themselves from external threats. Political Science and International Relations studies how societies govern themselves and the collective decisions, or public policies, they need, or choose, to make. Attention is given to the different ways government is organised; values such as liberty, participation, majority rule and minority rights which inform political institutions and public policy; and ideologies such as conservatism, liberalism, socialism, feminism and environmentalism which have motivated much political action in modern societies. International relations focuses on the ways in which states and peoples interact with other states, regional or global political organisations, and social movements in an increasingly interdependent world.",
        "Outcomes": [
            "Demonstrate advanced knowledge about the nature of politics and the functions of diverse political ideas, theories, actors, institutions and systems;",
            "Critically evaluate key political and policy dynamics at local, national, transnational, regional and international levels;",
            "Creatively apply critical thinking and problem-solving skills to independently and collaboratively address challenges, crises and change in the political world;",
            "Competently apply basic political science and international relations methods and skills to designing and executing social research; and",
            "Effectively communicate political knowledge, ideas, analyses and arguments in different formats.."
        ],
        "Level1Units": [
            "POLS1101",
            "POLS1102"
        ],
        "Level2Units": [
            "IREL2001",
            "POLS2201",
            "POLS2202",
            "POLS2220"
        ],
        "Level3Units": [
            "POLS3204",
            "POLS3231",
            "POLS3302",
            "POLS3308",
            "POLS3324",
            "POLS3334",
            "POLS3335",
            "POLS3342"
        ],
        "Level4Units": []
    },
    "MJD-ECNPF": {
        "Name": "Professional Economics",
        "Description": "The Economics extended major provides you with a concentrated program of study in economics and is designed for students seeking to become professional economists and pursue careers as specialist economists in government and business, economic consultants, economic analysts and policy advisers. Students study microeconomic and macroeconomic frameworks to rationally analyse general economic problems, establish conclusions and communicate the results of economic research to fellow economists, business professionals and policymakers. Students develop the capacity to analyse economic activities and issues both domestically and globally.",
        "Outcomes": [
            "Demonstrate comprehensive theoretical and applied economic knowledge.;",
            "Apply qualitative and quantitative economic techniques to analyse and evaluate key economic information to inform effective decision-making.;",
            "Be effective and perceptive communicators of economic information to specialist and non-specialist audiences.;",
            "Be effective team members and work effectively and collaboratively with others.;",
            "Apply reflective and critical thinking skills to economic problems across diverse contexts with responsibility and accountability.; and",
            "demonstate awareness of ethical, cultural, social and sustainability issues relevant to the discipline.."
        ],
        "Level1Units": [
            "ECON1101",
            "ECON1102",
            "FINA1221",
            "STAT1520"
        ],
        "Level2Units": [
            "ECON2233",
            "ECON2234",
            "ECON2271",
            "ECON2272"
        ],
        "Level3Units": [
            "ECON3302",
            "ECON3303",
            "ECON3371"
        ],
        "Level4Units": []
    },
    "MJD-PSYCH": {
        "Name": "Psychological and Behavioural Sciences",
        "Description": "Psychology is a fascinating and diverse area of study that touches upon many aspects of daily life, seeking to answer questions about how and why people behave the way they do. \r\nThe Psychological and Behavioural Sciences major will help you develop a scientific understanding of human thoughts and behaviours, the psychological processes underlying these and the relationship of these processes to brain function. You will find an emphasis on the measurement of psychological abilities, how these develop through the lifespan and the processes that govern the relationships between people and groups in a multicultural society. You will also develop an understanding of how psychological processes are affected by ageing, brain damage and disease. \r\n",
        "Outcomes": [
            "Demonstrate knowledge and understanding of selected psychological processes, their development, and the relations between them;",
            "Demonstrate knowledge and understanding of the scientific method in psychology;",
            "Demonstrate critical thinking in psychology, including an appreciation of the use of the scientific method to study psychological processes;",
            "Demonstrate skills in the analysis and presentation of quantitative data;",
            "Demonstrate effective written and oral communication skills consistent with expectations in the professional discipline of psychology;",
            "Work effectively as a team member in solving problems; and",
            "demonstrate a knowledge of appropriate cultural responsiveness in the application of psychology."
        ],
        "Prerequisites": "Enrolment in the BP001 Bachelor of Arts, the BP004 Bachelor of Science, the BH005 Bachelor of Philosophy (Honours), or the CM023 Bachelor of Science and Master of Teaching - Secondary",
        "Level1Units": [
            "PSYC1101",
            "PSYC1102"
        ],
        "Level2Units": [
            "PSYC2203",
            "PSYC2212",
            "PSYC2213",
            "PSYC2217"
        ],
        "Level3Units": [
            "PSYC3302",
            "PSYC3314",
            "PSYC3315",
            "PSYC3318"
        ],
        "Level4Units": []
    },
    "MJD-PSYDM": {
        "Name": "Psychology",
        "Description": "Psychology is a fascinating and diverse area of study that touches upon many aspects of daily life, seeking to answer questions about how and why people behave the way they do. The Psychology extended major will help you develop a scientific understanding of human thoughts and behaviours, the psychological processes underlying these and the relationship of these processes to brain function. You will find an emphasis on the measurement of psychological abilities, how these develop through the lifespan and on the processes that govern the relationships between people and groups in a multicultural society. You will also develop an understanding of how psychological processes are affected by ageing, brain damage and disease. ",
        "Outcomes": [
            "Demonstrate knowledge and understanding of selected psychological processes, their development, and the relations between them;",
            "Demonstrate knowledge and understanding of the scientific method in psychology;",
            "Demonstrate critical thinking in psychology, including an appreciation of the use of the scientific method to study psychological processes;",
            "Demonstrate skills in the analysis and presentation of quantitative data;",
            "Demonstrate effective written and oral communication skills consistent with expectations in the professional discipline of psychology;",
            "Work effectively as a team member in solving problems; and",
            "demonstrate a knowledge of appropriate cultural responsiveness in the application of psychology."
        ],
        "Level1Units": [
            "PSYC1101",
            "PSYC1102"
        ],
        "Level2Units": [
            "PSYC2203",
            "PSYC2212",
            "PSYC2213",
            "PSYC2217"
        ],
        "Level3Units": [
            "PSYC3302",
            "PSYC3309",
            "PSYC3310",
            "PSYC3314",
            "PSYC3315",
            "PSYC3318"
        ],
        "Level4Units": []
    },
    "MJD-SCITS": {
        "Name": "Science and Technology in Society",
        "Description": "Science and technology influence much that happens in our world.  Understanding the social context of science and technology is an important part of scientific literacy.  The SCTS major innovatively integrates the skills and knowledge relevant to both science and humanities education.  As the only program of its kind in WA, the SCTS major will appeal to students and employers alike who value this integration.  In the SCTS major, students receive a broad grounding in historical, philosophical, and social dimensions to science and technology with a focused thread on biological sciences and technologies running through all core units in the major. Drawing on units from four schools at UWA, the SCTS major integrates science, technology, and the humanities.  Students will gain substantive knowledge of SCTS as an established interdisciplinary area of study.  They will also develop the corresponding analytic, technical, and integrative skills much in demand by employers seeking students with flexible suites of learning skills.",
        "Outcomes": [
            "Analyse how scientific knowledge is made and be able to interpret scientific information;",
            "Interpret the historical and social contexts in which scientific knowledge and technology are created, debated, critiqued, and applied;",
            "Apply key theories and concepts within the fields of the history and philosophy of science and of science and technology studies to a range of contexts;",
            "Evaluate problems arising for the development and application of scientific knowledge and technology; and",
            "demonstrate a capacity for self-reflection and an understanding of philosophical and ethical issues in science and technology."
        ],
        "Level1Units": [
            "INDG1150",
            "PHIL1001",
            "SCOM1101"
        ],
        "Level2Units": [
            "ANIM2001",
            "GEND2903",
            "PHIL2001",
            "PHIL2005"
        ],
        "Level3Units": [
            "ANHB3321",
            "SCOM3319",
            "SCTS3001"
        ],
        "Level4Units": []
    },
    "MJD-SPNHB": {
        "Name": "Spanish Studies",
        "Description": "Studying Spanish is not simply about learning a language—it's an experience that will open your mind to different cultures. Spanish Studies helps you achieve a functional level of competency in listening, speaking, writing and reading the Spanish language from Spain. Learning the language also introduces you to the culture and intellectual accomplishments of Spanish-speaking people in Spain itself and the many Spanish-speaking countries around the world. This major is offered to beginners. During the course you will also study past and present Spanish literature, films and popular culture, providing you with a holistic and stimulating cultural and educational experience.",
        "Outcomes": [
            "Show competence in the spanish language in the four macroskills of language acquisition—reading, writing, listening and speaking—rated according to the common european framework for languages (cefr);",
            "Interact confidently and successfully in situations involving spanish cultural conventions;",
            "Interpret spanish language texts—written, audio, visual—in the light of spanish cultures and societies; and",
            "shift with accuracy and skill between the English and Spanish languages and cultures."
        ],
        "Level1Units": [
            "SPAN1401",
            "SPAN1402"
        ],
        "Level2Units": [
            "SPAN2403",
            "SPAN2404",
            "SPAN2812"
        ],
        "Level3Units": [
            "SPAN3405",
            "SPAN3406",
            "SPAN3813"
        ],
        "Level4Units": []
    },
    "MJD-ABHWB": {
        "Name": "Aboriginal Health and Wellbeing",
        "Description": "The Aboriginal Health and Wellbeing major will provide you with a solid grounding in the multiple determinants that influence the health and wellbeing of Aboriginal peoples, families and communities in Australia. You will gain a broad introduction to Aboriginal health and wellbeing from an Aboriginal perspective; an understanding of the underlying issues that influence health and wellbeing from historical, cultural, environmental, political and spiritual perspectives; an understanding of particular health problems within Aboriginal communities and their impacts; knowledge of the strategies, policies and practices that have been implemented to improve health and wellbeing with a particular focus on Aboriginal community-led initiatives; and practical experience in Aboriginal health settings.",
        "Outcomes": [
            "Explain aboriginal health and wellbeing from the perspectives of aboriginal peoples;",
            "Demonstrate an understanding of the underlying issues that influence health and wellbeing from historical, environmental, cultural, political and spiritual perspectives;",
            "Identify particular health problems within aboriginal communities and their impacts;",
            "Demonstrate knowledge of the strategies, policies and practices that have been implemented to improve health and wellbeing with a particular focus on aboriginal-community-led initiatives;",
            "Demonstrate practical experience in aboriginal health settings;",
            "Demonstrate a strong fundamental knowledge of human biology assisting in evaluating the biological evidence about disease mechanisms; and",
            "integrate this biological knowledge with their understanding of Aboriginal ways, health and disease in formulating effective strategies required to address health issues."
        ],
        "Prerequisites": "Students who have not achieved a scaled mark of at least 50 in ATAR Mathematics Applications or equivalent or higher, are required to successfully complete MATH1720 Mathematics Fundamentals in their first 48 points of study in this course.",
        "Level1Units": [
            "ANHB1101",
            "ANHB1102",
            "INDG1150",
            "INDG1160"
        ],
        "Level2Units": [
            "AHEA2201",
            "INDG2300",
            "PUBH2203",
            "PUBH2216"
        ],
        "Level3Units": [
            "AHEA3200",
            "AHEA3300",
            "AHEA3301",
            "INDG3300"
        ],
        "Level4Units": []
    }
}